/**
 * Created by zhiwen on 14-6-26.
 */

(function(){
    var nodegrass = require('nodegrass');
    var bigClass  = [

        {'name' : '一本文科大学推荐', data :

            [
                {'name':'全部一本文科大学', key:'1', data :
                    [{'name' : '清华大学', 'code' : '10003', 'link' : 'http://school.gaofen.com/college-10003.html', data : [
                        {name : '2010', sorce : [595, '668','73','14']},
                        {name : '2011', sorce : [580, '657','77','28']},
                        {name : '2012', sorce : [589, '667','78','16']},
                        {name : '2013', sorce : [594, '672','78','14']},
                        {name : '平均', sorce : ['', '666','76.5','18']}]},
                        {'name' : '北京大学', 'code' : '10001', 'link' : 'http://school.gaofen.com/college-10001.html', data : [
                            {name : '2010', sorce : [595, '666','71','23']},
                            {name : '2011', sorce : [580, '659','79','25']},
                            {name : '2012', sorce : [589, '663','74','28']},
                            {name : '2013', sorce : [594, '668','74','30']},
                            {name : '平均', sorce : ['', '664','74.5','26.5']}]},
                        {'name' : '复旦大学', 'code' : '10246', 'link' : 'http://school.gaofen.com/college-10246.html', data : [
                            {name : '2010', sorce : [595, '656','61','89']},
                            {name : '2011', sorce : [580, '649','69','81']},
                            {name : '2012', sorce : [589, '658','69','59']},
                            {name : '2013', sorce : [594, '662','68','69']},
                            {name : '平均', sorce : ['', '656.25','66.75','74.5']}]},
                        {'name' : '上海交通大学', 'code' : '10248', 'link' : 'http://school.gaofen.com/college-10248.html', data : [
                            {name : '2010', sorce : [595, '','','']},
                            {name : '2011', sorce : [580, '654','74','40']},
                            {name : '2012', sorce : [589, '638','49','403']},
                            {name : '2013', sorce : [594, '664','70','45']},
                            {name : '平均', sorce : ['', '652','64.3333333333','162.6666666667']}]},
                        {'name' : '中国人民大学', 'code' : '10002', 'link' : 'http://school.gaofen.com/college-10002.html', data : [
                            {name : '2010', sorce : [595, '655','60','107']},
                            {name : '2011', sorce : [580, '646','66','113']},
                            {name : '2012', sorce : [589, '646','57','176']},
                            {name : '2013', sorce : [594, '655','61','139']},
                            {name : '平均', sorce : ['', '650.5','61','133.75']}]},
                        {'name' : '浙江大学', 'code' : '10335', 'link' : 'http://school.gaofen.com/college-10335.html', data : [
                            {name : '2010', sorce : [595, '646','51','310']},
                            {name : '2011', sorce : [580, '639','59','210']},
                            {name : '2012', sorce : [589, '647','58','163']},
                            {name : '2013', sorce : [594, '649','55','248']},
                            {name : '平均', sorce : ['', '645.25','55.75','232.75']}]},
                        {'name' : '南京大学', 'code' : '10284', 'link' : 'http://school.gaofen.com/college-10284.html', data : [
                            {name : '2010', sorce : [595, '647','52','267']},
                            {name : '2011', sorce : [580, '637','57','267']},
                            {name : '2012', sorce : [589, '643','54','240']},
                            {name : '2013', sorce : [594, '649','55','260']},
                            {name : '平均', sorce : ['', '644','54.5','258.5']}]},
                        {'name' : '武汉大学', 'code' : '10486', 'link' : 'http://school.gaofen.com/college-10486.html', data : [
                            {name : '2010', sorce : [595, '631','36','1245']},
                            {name : '2011', sorce : [580, '617','37','1373']},
                            {name : '2012', sorce : [589, '617','28','2172']},
                            {name : '2013', sorce : [594, '630','36','1303']},
                            {name : '平均', sorce : ['', '623.75','34.25','1523.25']}]},
                        {'name' : '中山大学', 'code' : '10558', 'link' : 'http://school.gaofen.com/college-10558.html', data : [
                            {name : '2010', sorce : [595, '620','25','2697']},
                            {name : '2011', sorce : [580, '615','35','1687']},
                            {name : '2012', sorce : [589, '620','31','1764']},
                            {name : '2013', sorce : [594, '629','35','1506']},
                            {name : '平均', sorce : ['', '621','31.5','1913.5']}]},
                        {'name' : '南开大学', 'code' : '10055', 'link' : 'http://school.gaofen.com/college-10055.html', data : [
                            {name : '2010', sorce : [595, '638','43','656']},
                            {name : '2011', sorce : [580, '587','7','7968']},
                            {name : '2012', sorce : [589, '620','31','1776']},
                            {name : '2013', sorce : [594, '627','33','1637']},
                            {name : '平均', sorce : ['', '618','28.5','3009.25']}]},
                        {'name' : '暨南大学', 'code' : '10559', 'link' : 'http://school.gaofen.com/college-10559.html', data : [
                            {name : '2010', sorce : [595, '614','19','4081']},
                            {name : '2011', sorce : [580, '613','33','2693']},
                            {name : '2012', sorce : [589, '612','23','3035']},
                            {name : '2013', sorce : [594, '621','27','2531']},
                            {name : '平均', sorce : ['', '615','25.5','3085']}]},
                        {'name' : '四川大学', 'code' : '10610', 'link' : 'http://school.gaofen.com/college-10610.html', data : [
                            {name : '2010', sorce : [595, '614','19','3955']},
                            {name : '2011', sorce : [580, '605','25','3237']},
                            {name : '2012', sorce : [589, '614','25','2635']},
                            {name : '2013', sorce : [594, '618','24','3118']},
                            {name : '平均', sorce : ['', '612.75','23.25','3236.25']}]},
                        {'name' : '华中科技大学', 'code' : '10487', 'link' : 'http://school.gaofen.com/college-10487.html', data : [
                            {name : '2010', sorce : [595, '619','24','2902']},
                            {name : '2011', sorce : [580, '591','11','6520']},
                            {name : '2012', sorce : [589, '606','17','4217']},
                            {name : '2013', sorce : [594, '619','25','2937']},
                            {name : '平均', sorce : ['', '608.75','19.25','4144']}]},
                        {'name' : '华南理工大学', 'code' : '10561', 'link' : 'http://school.gaofen.com/college-10561.html', data : [
                            {name : '2010', sorce : [595, '606','11','6262']},
                            {name : '2011', sorce : [580, '602','22','3844']},
                            {name : '2012', sorce : [589, '610','21','3538']},
                            {name : '2013', sorce : [594, '615','21','3587']},
                            {name : '平均', sorce : ['', '608.25','18.75','4307.75']}]},
                        {'name' : '山东大学', 'code' : '10442', 'link' : 'http://school.gaofen.com/college-10442.html', data : [
                            {name : '2010', sorce : [595, '618','23','3093']},
                            {name : '2011', sorce : [580, '606','26','2949']},
                            {name : '2012', sorce : [589, '590','1','9540']},
                            {name : '2013', sorce : [594, '612','18','4280']},
                            {name : '平均', sorce : ['', '606.5','17','4965.5']}]},
                        {'name' : '吉林大学', 'code' : '10183', 'link' : 'http://school.gaofen.com/college-10183.html', data : [
                            {name : '2010', sorce : [595, '601','6','7931']},
                            {name : '2011', sorce : [580, '594','14','5655']},
                            {name : '2012', sorce : [589, '608','19','3778']},
                            {name : '2013', sorce : [594, '615','21','3648']},
                            {name : '平均', sorce : ['', '604.5','15','5253']}]},
                        {'name' : '中南大学', 'code' : '10533', 'link' : 'http://school.gaofen.com/college-10533.html', data : [
                            {name : '2010', sorce : [595, '606','11','6125']},
                            {name : '2011', sorce : [580, '593','13','6024']},
                            {name : '2012', sorce : [589, '601','12','5533']},
                            {name : '2013', sorce : [594, '611','17','4715']},
                            {name : '平均', sorce : ['', '602.75','13.25','5599.25']}]},
                        {'name' : '广东外语外贸大学', 'code' : '11846', 'link' : 'http://school.gaofen.com/college-11846.html', data : [
                            {name : '2010', sorce : [595, '604','9','6871']},
                            {name : '2011', sorce : [580, '593','13','5971']},
                            {name : '2012', sorce : [589, '596','7','7206']},
                            {name : '2013', sorce : [594, '604','10','6675']},
                            {name : '平均', sorce : ['', '599.25','9.75','6680.75']}]},
                        {'name' : '华南师范大学', 'code' : '10574', 'link' : 'http://school.gaofen.com/college-10574.html', data : [
                            {name : '2010', sorce : [595, '598','3','9417']},
                            {name : '2011', sorce : [580, '587','7','8116']},
                            {name : '2012', sorce : [589, '593','4','8255']},
                            {name : '2013', sorce : [594, '599','5','8692']},
                            {name : '平均', sorce : ['', '594.25','4.75','8620']}]},
                        {'name' : '西安交通大学', 'code' : '10613', 'link' : 'http://school.gaofen.com/college-10613.html', data : [
                            {name : '2010', sorce : [595, '599','4','8974']},
                            {name : '2011', sorce : [580, '585','5','8771']},
                            {name : '2012', sorce : [589, '597','8','7011']},
                            {name : '2013', sorce : [594, '594','0','10964']},
                            {name : '平均', sorce : ['', '593.75','4.25','8930']}]},
                        {'name' : '汕头大学', 'code' : '10560', 'link' : 'http://school.gaofen.com/college-10560.html', data : [
                            {name : '2010', sorce : [595, '595','0','10851']},
                            {name : '2011', sorce : [580, '580','0','11288']},
                            {name : '2012', sorce : [589, '589','0','']},
                            {name : '2013', sorce : [594, '595','1','10280']},
                            {name : '平均', sorce : ['', '589.75','0.25','10806.3333333333']}]},
                        {'name' : '南方医科大学', 'code' : '12121', 'link' : 'http://school.gaofen.com/college-12121.html', data : [
                            {name : '2010', sorce : [595, '595','0','10673']},
                            {name : '2011', sorce : [580, '580','0','14274']},
                            {name : '2012', sorce : [589, '589','0','']},
                            {name : '2013', sorce : [594, '594','0','']},
                            {name : '平均', sorce : ['', '589.5','0','12473.5']}]},
                        {'name' : '广州中医药大学', 'code' : '10572', 'link' : 'http://school.gaofen.com/college-10572.html', data : [
                            {name : '2010', sorce : [595, '595','0','10830']},
                            {name : '2011', sorce : [580, '580','0','16863']},
                            {name : '2012', sorce : [589, '589','0','']},
                            {name : '2013', sorce : [594, '594','0','']},
                            {name : '平均', sorce : ['', '589.5','0','13846.5']}]},
                        {'name' : '华南农业大学', 'code' : '10564', 'link' : 'http://school.gaofen.com/college-10564.html', data : [
                            {name : '2010', sorce : [595, '595','0','10869']},
                            {name : '2011', sorce : [580, '580','0','']},
                            {name : '2012', sorce : [589, '589','0','']},
                            {name : '2013', sorce : [594, '594','0','10980']},
                            {name : '平均', sorce : ['', '589.5','0','10924.5']}]}
                    ]},

                {'name':'超一本线 0-19.9 分', key:'2', data : [
                    {'name' : '华中科技大学', 'code' : '10487', 'link' : 'http://school.gaofen.com/college-10487.html', data : [
                        {name : '2010', sorce : [595, '619','24','2902']},
                        {name : '2011', sorce : [580, '591','11','6520']},
                        {name : '2012', sorce : [589, '606','17','4217']},
                        {name : '2013', sorce : [594, '619','25','2937']},
                        {name : '平均', sorce : ['', '608.75','19.25','4144']}]},
                    {'name' : '华南理工大学', 'code' : '10561', 'link' : 'http://school.gaofen.com/college-10561.html', data : [
                        {name : '2010', sorce : [595, '606','11','6262']},
                        {name : '2011', sorce : [580, '602','22','3844']},
                        {name : '2012', sorce : [589, '610','21','3538']},
                        {name : '2013', sorce : [594, '615','21','3587']},
                        {name : '平均', sorce : ['', '608.25','18.75','4307.75']}]},
                    {'name' : '山东大学', 'code' : '10442', 'link' : 'http://school.gaofen.com/college-10442.html', data : [
                        {name : '2010', sorce : [595, '618','23','3093']},
                        {name : '2011', sorce : [580, '606','26','2949']},
                        {name : '2012', sorce : [589, '590','1','9540']},
                        {name : '2013', sorce : [594, '612','18','4280']},
                        {name : '平均', sorce : ['', '606.5','17','4965.5']}]},
                    {'name' : '吉林大学', 'code' : '10183', 'link' : 'http://school.gaofen.com/college-10183.html', data : [
                        {name : '2010', sorce : [595, '601','6','7931']},
                        {name : '2011', sorce : [580, '594','14','5655']},
                        {name : '2012', sorce : [589, '608','19','3778']},
                        {name : '2013', sorce : [594, '615','21','3648']},
                        {name : '平均', sorce : ['', '604.5','15','5253']}]},
                    {'name' : '中南大学', 'code' : '10533', 'link' : 'http://school.gaofen.com/college-10533.html', data : [
                        {name : '2010', sorce : [595, '606','11','6125']},
                        {name : '2011', sorce : [580, '593','13','6024']},
                        {name : '2012', sorce : [589, '601','12','5533']},
                        {name : '2013', sorce : [594, '611','17','4715']},
                        {name : '平均', sorce : ['', '602.75','13.25','5599.25']}]},
                    {'name' : '广东外语外贸大学', 'code' : '11846', 'link' : 'http://school.gaofen.com/college-11846.html', data : [
                        {name : '2010', sorce : [595, '604','9','6871']},
                        {name : '2011', sorce : [580, '593','13','5971']},
                        {name : '2012', sorce : [589, '596','7','7206']},
                        {name : '2013', sorce : [594, '604','10','6675']},
                        {name : '平均', sorce : ['', '599.25','9.75','6680.75']}]},
                    {'name' : '华南师范大学', 'code' : '10574', 'link' : 'http://school.gaofen.com/college-10574.html', data : [
                        {name : '2010', sorce : [595, '598','3','9417']},
                        {name : '2011', sorce : [580, '587','7','8116']},
                        {name : '2012', sorce : [589, '593','4','8255']},
                        {name : '2013', sorce : [594, '599','5','8692']},
                        {name : '平均', sorce : ['', '594.25','4.75','8620']}]},
                    {'name' : '西安交通大学', 'code' : '10613', 'link' : 'http://school.gaofen.com/college-10613.html', data : [
                        {name : '2010', sorce : [595, '599','4','8974']},
                        {name : '2011', sorce : [580, '585','5','8771']},
                        {name : '2012', sorce : [589, '597','8','7011']},
                        {name : '2013', sorce : [594, '594','0','10964']},
                        {name : '平均', sorce : ['', '593.75','4.25','8930']}]},
                    {'name' : '汕头大学', 'code' : '10560', 'link' : 'http://school.gaofen.com/college-10560.html', data : [
                        {name : '2010', sorce : [595, '595','0','10851']},
                        {name : '2011', sorce : [580, '580','0','11288']},
                        {name : '2012', sorce : [589, '589','0','']},
                        {name : '2013', sorce : [594, '595','1','10280']},
                        {name : '平均', sorce : ['', '589.75','0.25','10806.3333333333']}]},
                    {'name' : '南方医科大学', 'code' : '12121', 'link' : 'http://school.gaofen.com/college-12121.html', data : [
                        {name : '2010', sorce : [595, '595','0','10673']},
                        {name : '2011', sorce : [580, '580','0','14274']},
                        {name : '2012', sorce : [589, '589','0','']},
                        {name : '2013', sorce : [594, '594','0','']},
                        {name : '平均', sorce : ['', '589.5','0','12473.5']}]},
                    {'name' : '广州中医药大学', 'code' : '10572', 'link' : 'http://school.gaofen.com/college-10572.html', data : [
                        {name : '2010', sorce : [595, '595','0','10830']},
                        {name : '2011', sorce : [580, '580','0','16863']},
                        {name : '2012', sorce : [589, '589','0','']},
                        {name : '2013', sorce : [594, '594','0','']},
                        {name : '平均', sorce : ['', '589.5','0','13846.5']}]},
                    {'name' : '华南农业大学', 'code' : '10564', 'link' : 'http://school.gaofen.com/college-10564.html', data : [
                        {name : '2010', sorce : [595, '595','0','10869']},
                        {name : '2011', sorce : [580, '580','0','']},
                        {name : '2012', sorce : [589, '589','0','']},
                        {name : '2013', sorce : [594, '594','0','10980']},
                        {name : '平均', sorce : ['', '589.5','0','10924.5']}]}
                ]},
                {'name':'超一本线 20-39.9 分', key:'3', data : [{'name' : '武汉大学', 'code' : '10486', 'link' : 'http://school.gaofen.com/college-10486.html', data : [
                    {name : '2010', sorce : [595, '631','36','1245']},
                    {name : '2011', sorce : [580, '617','37','1373']},
                    {name : '2012', sorce : [589, '617','28','2172']},
                    {name : '2013', sorce : [594, '630','36','1303']},
                    {name : '平均', sorce : ['', '623.75','34.25','1523.25']}]},
                    {'name' : '中山大学', 'code' : '10558', 'link' : 'http://school.gaofen.com/college-10558.html', data : [
                        {name : '2010', sorce : [595, '620','25','2697']},
                        {name : '2011', sorce : [580, '615','35','1687']},
                        {name : '2012', sorce : [589, '620','31','1764']},
                        {name : '2013', sorce : [594, '629','35','1506']},
                        {name : '平均', sorce : ['', '621','31.5','1913.5']}]},
                    {'name' : '南开大学', 'code' : '10055', 'link' : 'http://school.gaofen.com/college-10055.html', data : [
                        {name : '2010', sorce : [595, '638','43','656']},
                        {name : '2011', sorce : [580, '587','7','7968']},
                        {name : '2012', sorce : [589, '620','31','1776']},
                        {name : '2013', sorce : [594, '627','33','1637']},
                        {name : '平均', sorce : ['', '618','28.5','3009.25']}]},
                    {'name' : '暨南大学', 'code' : '10559', 'link' : 'http://school.gaofen.com/college-10559.html', data : [
                        {name : '2010', sorce : [595, '614','19','4081']},
                        {name : '2011', sorce : [580, '613','33','2693']},
                        {name : '2012', sorce : [589, '612','23','3035']},
                        {name : '2013', sorce : [594, '621','27','2531']},
                        {name : '平均', sorce : ['', '615','25.5','3085']}]},
                    {'name' : '四川大学', 'code' : '10610', 'link' : 'http://school.gaofen.com/college-10610.html', data : [
                        {name : '2010', sorce : [595, '614','19','3955']},
                        {name : '2011', sorce : [580, '605','25','3237']},
                        {name : '2012', sorce : [589, '614','25','2635']},
                        {name : '2013', sorce : [594, '618','24','3118']},
                        {name : '平均', sorce : ['', '612.75','23.25','3236.25']}]}

                ]},
                {'name':'超一本线 40-59.9 分', key:'4', data : [
                    {'name' : '浙江大学', 'code' : '10335', 'link' : 'http://school.gaofen.com/college-10335.html', data : [
                        {name : '2010', sorce : [595, '646','51','310']},
                        {name : '2011', sorce : [580, '639','59','210']},
                        {name : '2012', sorce : [589, '647','58','163']},
                        {name : '2013', sorce : [594, '649','55','248']},
                        {name : '平均', sorce : ['', '645.25','55.75','232.75']}]},
                    {'name' : '南京大学', 'code' : '10284', 'link' : 'http://school.gaofen.com/college-10284.html', data : [
                        {name : '2010', sorce : [595, '647','52','267']},
                        {name : '2011', sorce : [580, '637','57','267']},
                        {name : '2012', sorce : [589, '643','54','240']},
                        {name : '2013', sorce : [594, '649','55','260']},
                        {name : '平均', sorce : ['', '644','54.5','258.5']}]}
                ]},
                {'name':'超一本线 60-79.9 分', key:'5', data : [
                    {'name' : '清华大学', 'code' : '10003', 'link' : 'http://school.gaofen.com/college-10003.html', data : [
                        {name : '2010', sorce : [595, '668','73','14']},
                        {name : '2011', sorce : [580, '657','77','28']},
                        {name : '2012', sorce : [589, '667','78','16']},
                        {name : '2013', sorce : [594, '672','78','14']},
                        {name : '平均', sorce : ['', '666','76.5','18']}]},
                    {'name' : '北京大学', 'code' : '10001', 'link' : 'http://school.gaofen.com/college-10001.html', data : [
                        {name : '2010', sorce : [595, '666','71','23']},
                        {name : '2011', sorce : [580, '659','79','25']},
                        {name : '2012', sorce : [589, '663','74','28']},
                        {name : '2013', sorce : [594, '668','74','30']},
                        {name : '平均', sorce : ['', '664','74.5','26.5']}]},
                    {'name' : '复旦大学', 'code' : '10246', 'link' : 'http://school.gaofen.com/college-10246.html', data : [
                        {name : '2010', sorce : [595, '656','61','89']},
                        {name : '2011', sorce : [580, '649','69','81']},
                        {name : '2012', sorce : [589, '658','69','59']},
                        {name : '2013', sorce : [594, '662','68','69']},
                        {name : '平均', sorce : ['', '656.25','66.75','74.5']}]},
                    {'name' : '上海交通大学', 'code' : '10248', 'link' : 'http://school.gaofen.com/college-10248.html', data : [
                        {name : '2010', sorce : [595, '','','']},
                        {name : '2011', sorce : [580, '654','74','40']},
                        {name : '2012', sorce : [589, '638','49','403']},
                        {name : '2013', sorce : [594, '664','70','45']},
                        {name : '平均', sorce : ['', '652','64.3333333333','162.6666666667']}]},
                    {'name' : '中国人民大学', 'code' : '10002', 'link' : 'http://school.gaofen.com/college-10002.html', data : [
                        {name : '2010', sorce : [595, '655','60','107']},
                        {name : '2011', sorce : [580, '646','66','113']},
                        {name : '2012', sorce : [589, '646','57','176']},
                        {name : '2013', sorce : [594, '655','61','139']},
                        {name : '平均', sorce : ['', '650.5','61','133.75']}]}
                ]},
                {'name':'超一本线 80-100 分', key:'6', data : [

                ]}]

        },

        {'name' : '一本理科大学推荐', data : [{'name':'全部一本理科大学', key:'7', data :
            [
                {'name' : '清华大学', 'code' : '10003', 'link' : 'http://school.gaofen.com/college-10003.html', data : [
                    {name : '2010', sorce : [621, '694','73','110']},
                    {name : '2011', sorce : [568, '666','98','95']},
                    {name : '2012', sorce : [585, '684','99','96']},
                    {name : '2013', sorce : [574, '681','107','111']},
                    {name : '平均', sorce : ['', '681.25','94.25','103']}]},
                {'name' : '北京大学', 'code' : '10001', 'link' : 'http://school.gaofen.com/college-10001.html', data : [
                    {name : '2010', sorce : [621, '697','73','118']},
                    {name : '2011', sorce : [568, '665','97','101']},
                    {name : '2012', sorce : [585, '683','98','100']},
                    {name : '2013', sorce : [574, '681','107','114']},
                    {name : '平均', sorce : ['', '681.5','93.75','108.25']}]},
                {'name' : '上海交通大学', 'code' : '10248', 'link' : 'http://school.gaofen.com/college-10248.html', data : [
                    {name : '2010', sorce : [621, '686','65','351']},
                    {name : '2011', sorce : [568, '654','86','284']},
                    {name : '2012', sorce : [585, '671','86','309']},
                    {name : '2013', sorce : [574, '672','98','274']},
                    {name : '平均', sorce : ['', '670.75','83.75','304.5']}]},
                {'name' : '复旦大学', 'code' : '10246', 'link' : 'http://school.gaofen.com/college-10246.html', data : [
                    {name : '2010', sorce : [621, '684','63','429']},
                    {name : '2011', sorce : [568, '655','87','260']},
                    {name : '2012', sorce : [585, '664','79','601']},
                    {name : '2013', sorce : [574, '674','100','236']},
                    {name : '平均', sorce : ['', '669.25','82.25','381.5']}]},
                {'name' : '中国人民大学', 'code' : '10002', 'link' : 'http://school.gaofen.com/college-10002.html', data : [
                    {name : '2010', sorce : [621, '682','61','519']},
                    {name : '2011', sorce : [568, '645','77','625']},
                    {name : '2012', sorce : [585, '661','76','772']},
                    {name : '2013', sorce : [574, '663','89','613']},
                    {name : '平均', sorce : ['', '662.75','75.75','632.25']}]},
                {'name' : '中国科学技术大学', 'code' : '10358', 'link' : 'http://school.gaofen.com/college-10358.html', data : [
                    {name : '2010', sorce : [621, '680','59','718']},
                    {name : '2011', sorce : [568, '643','75','700']},
                    {name : '2012', sorce : [585, '663','78','677']},
                    {name : '2013', sorce : [574, '661','87','727']},
                    {name : '平均', sorce : ['', '661.75','74.75','705.5']}]},
                {'name' : '浙江大学', 'code' : '10335', 'link' : 'http://school.gaofen.com/college-10335.html', data : [
                    {name : '2010', sorce : [621, '682','61','533']},
                    {name : '2011', sorce : [568, '648','80','501']},
                    {name : '2012', sorce : [585, '667','82','487']},
                    {name : '2013', sorce : [574, '665','91','527']},
                    {name : '平均', sorce : ['', '665.5','78.5','512']}]},
                {'name' : '南京大学', 'code' : '10284', 'link' : 'http://school.gaofen.com/college-10284.html', data : [
                    {name : '2010', sorce : [621, '678','57','839']},
                    {name : '2011', sorce : [568, '642','74','780']},
                    {name : '2012', sorce : [585, '660','75','803']},
                    {name : '2013', sorce : [574, '660','86','793']},
                    {name : '平均', sorce : ['', '660','73','803.75']}]},
                {'name' : '南开大学', 'code' : '10055', 'link' : 'http://school.gaofen.com/college-10055.html', data : [
                    {name : '2010', sorce : [621, '671','50','1753']},
                    {name : '2011', sorce : [568, '628','60','2032']},
                    {name : '2012', sorce : [585, '648','63','1893']},
                    {name : '2013', sorce : [574, '646','72','2041']},
                    {name : '平均', sorce : ['', '648.25','61.25','1929.75']}]},
                {'name' : '东南大学', 'code' : '10286', 'link' : 'http://school.gaofen.com/college-10286.html', data : [
                    {name : '2010', sorce : [621, '648','27','9234']},
                    {name : '2011', sorce : [568, '596','28','11297']},
                    {name : '2012', sorce : [585, '619','34','9110']},
                    {name : '2013', sorce : [574, '619','45','8187']},
                    {name : '平均', sorce : ['', '620.5','33.5','9457']}]},
                {'name' : '天津大学', 'code' : '10056', 'link' : 'http://school.gaofen.com/college-10056.html', data : [
                    {name : '2010', sorce : [621, '654','33','6611']},
                    {name : '2011', sorce : [568, '593','25','12966']},
                    {name : '2012', sorce : [585, '615','30','10825']},
                    {name : '2013', sorce : [574, '618','44','8421']},
                    {name : '平均', sorce : ['', '620','33','9705.75']}]},
                {'name' : '华南理工大学', 'code' : '10561', 'link' : 'http://school.gaofen.com/college-10561.html', data : [
                    {name : '2010', sorce : [621, '645','24','10589']},
                    {name : '2011', sorce : [568, '600','32','9473']},
                    {name : '2012', sorce : [585, '619','34','9024']},
                    {name : '2013', sorce : [574, '617','43','9052']},
                    {name : '平均', sorce : ['', '620.25','33.25','9534.5']}]},
                {'name' : '中山大学', 'code' : '10558', 'link' : 'http://school.gaofen.com/college-10558.html', data : [
                    {name : '2010', sorce : [621, '644','23','11428']},
                    {name : '2011', sorce : [568, '609','41','6151']},
                    {name : '2012', sorce : [585, '628','43','6082']},
                    {name : '2013', sorce : [574, '625','51','6309']},
                    {name : '平均', sorce : ['', '626.5','39.5','7492.5']}]},
                {'name' : '华中科技大学', 'code' : '10487', 'link' : 'http://school.gaofen.com/college-10487.html', data : [
                    {name : '2010', sorce : [621, '654','33','6329']},
                    {name : '2011', sorce : [568, '606','38','7159']},
                    {name : '2012', sorce : [585, '605','20','15332']},
                    {name : '2013', sorce : [574, '616','42','9385']},
                    {name : '平均', sorce : ['', '620.25','33.25','9551.25']}]},
                {'name' : '武汉大学', 'code' : '10486', 'link' : 'http://school.gaofen.com/college-10486.html', data : [
                    {name : '2010', sorce : [621, '655','34','5971']},
                    {name : '2011', sorce : [568, '608','40','6495']},
                    {name : '2012', sorce : [585, '617','32','9602']},
                    {name : '2013', sorce : [574, '622','48','7178']},
                    {name : '平均', sorce : ['', '625.5','38.5','7311.5']}]},
                {'name' : '暨南大学', 'code' : '10559', 'link' : 'http://school.gaofen.com/college-10559.html', data : [
                    {name : '2010', sorce : [621, '642','21','12674']},
                    {name : '2011', sorce : [568, '596','28','11312']},
                    {name : '2012', sorce : [585, '613','28','11744']},
                    {name : '2013', sorce : [574, '610','36','11843']},
                    {name : '平均', sorce : ['', '615.25','28.25','11893.25']}]},
                {'name' : '四川大学', 'code' : '10610', 'link' : 'http://school.gaofen.com/college-10610.html', data : [
                    {name : '2010', sorce : [621, '639','18','14285']},
                    {name : '2011', sorce : [568, '588','20','15640']},
                    {name : '2012', sorce : [585, '611','26','12524']},
                    {name : '2013', sorce : [574, '602','28','15834']},
                    {name : '平均', sorce : ['', '610','23','14570.75']}]},
                {'name' : '中南大学', 'code' : '10533', 'link' : 'http://school.gaofen.com/college-10533.html', data : [
                    {name : '2010', sorce : [621, '638','17','15261']},
                    {name : '2011', sorce : [568, '591','23','13994']},
                    {name : '2012', sorce : [585, '611','26','12514']},
                    {name : '2013', sorce : [574, '606','32','13974']},
                    {name : '平均', sorce : ['', '611.5','24.5','13935.75']}]},
                {'name' : '西安交通大学', 'code' : '10613', 'link' : 'http://school.gaofen.com/college-10613.html', data : [
                    {name : '2010', sorce : [621, '635','14','17479']},
                    {name : '2011', sorce : [568, '580','12','20792']},
                    {name : '2012', sorce : [585, '601','16','17702']},
                    {name : '2013', sorce : [574, '593','19','21190']},
                    {name : '平均', sorce : ['', '602.25','15.25','19290.75']}]},
                {'name' : '山东大学', 'code' : '10442', 'link' : 'http://school.gaofen.com/college-10442.html', data : [
                    {name : '2010', sorce : [621, '639','18','14519']},
                    {name : '2011', sorce : [568, '589','21','14621']},
                    {name : '2012', sorce : [585, '585','0','']},
                    {name : '2013', sorce : [574, '602','28','15693']},
                    {name : '平均', sorce : ['', '603.75','16.75','14944.3333333333']}]},
                {'name' : '哈尔滨工业大学', 'code' : '10213', 'link' : 'http://school.gaofen.com/college-10213.html', data : [
                    {name : '2010', sorce : [621, '652','31','7458']},
                    {name : '2011', sorce : [568, '570','2','27812']},
                    {name : '2012', sorce : [585, '618','33','9387']},
                    {name : '2013', sorce : [574, '585','11','27213']},
                    {name : '平均', sorce : ['', '606.25','19.25','17967.5']}]},
                {'name' : '吉林大学', 'code' : '10183', 'link' : 'http://school.gaofen.com/college-10183.html', data : [
                    {name : '2010', sorce : [621, '632','11','19526']},
                    {name : '2011', sorce : [568, '581','13','19965']},
                    {name : '2012', sorce : [585, '594','9','22234']},
                    {name : '2013', sorce : [574, '598','24','17854']},
                    {name : '平均', sorce : ['', '601.25','14.25','19894.75']}]},
                {'name' : '广东外语外贸大学', 'code' : '11846', 'link' : 'http://school.gaofen.com/college-11846.html', data : [
                    {name : '2010', sorce : [621, '634','13','17940']},
                    {name : '2011', sorce : [568, '588','20','15494']},
                    {name : '2012', sorce : [585, '602','17','17488']},
                    {name : '2013', sorce : [574, '599','25','17668']},
                    {name : '平均', sorce : ['', '605.75','18.75','17147.5']}]},
                {'name' : '华南师范大学', 'code' : '10574', 'link' : 'http://school.gaofen.com/college-10574.html', data : [
                    {name : '2010', sorce : [621, '628','7','22895']},
                    {name : '2011', sorce : [568, '581','13','19956']},
                    {name : '2012', sorce : [585, '597','12','20245']},
                    {name : '2013', sorce : [574, '592','18','22242']},
                    {name : '平均', sorce : ['', '599.5','12.5','21334.5']}]},
                {'name' : '汕头大学', 'code' : '10560', 'link' : 'http://school.gaofen.com/college-10560.html', data : [
                    {name : '2010', sorce : [621, '621','0','29498']},
                    {name : '2011', sorce : [568, '568','0','31440']},
                    {name : '2012', sorce : [585, '585','0','']},
                    {name : '2013', sorce : [574, '580','6','31117']},
                    {name : '平均', sorce : ['', '588.5','6','30685']}]},
                {'name' : '南方医科大学', 'code' : '12121', 'link' : 'http://school.gaofen.com/college-12121.html', data : [
                    {name : '2010', sorce : [621, '621','0','29546']},
                    {name : '2011', sorce : [568, '568','0','39168']},
                    {name : '2012', sorce : [585, '585','0','']},
                    {name : '2013', sorce : [574, '585','11','26823']},
                    {name : '平均', sorce : ['', '589.75','2.75','31845.6666666667']}]},
                {'name' : '广州中医药大学', 'code' : '10572', 'link' : 'http://school.gaofen.com/college-10572.html', data : [
                    {name : '2010', sorce : [621, '621','0','29545']},
                    {name : '2011', sorce : [568, '568','0','45214']},
                    {name : '2012', sorce : [585, '585','0','']},
                    {name : '2013', sorce : [574, '574','0','']},
                    {name : '平均', sorce : ['', '587','0','37379.5']}]},
                {'name' : '华南农业大学', 'code' : '10564', 'link' : 'http://school.gaofen.com/college-10564.html', data : [
                    {name : '2010', sorce : [621, '621','0','40748']},
                    {name : '2011', sorce : [568, '568','0','38573']},
                    {name : '2012', sorce : [585, '585','0','']},
                    {name : '2013', sorce : [574, '574','0','']},
                    {name : '平均', sorce : ['', '587','0','39660.5']}]}
            ]},

            {'name':'超一本线 0-19.9 分', key:'8', data : [
                {'name' : '西安交通大学', 'code' : '10613', 'link' : 'http://school.gaofen.com/college-10613.html', data : [
                    {name : '2010', sorce : [621, '635','14','17479']},
                    {name : '2011', sorce : [568, '580','12','20792']},
                    {name : '2012', sorce : [585, '601','16','17702']},
                    {name : '2013', sorce : [574, '593','19','21190']},
                    {name : '平均', sorce : ['', '602.25','15.25','19290.75']}]},
                {'name' : '山东大学', 'code' : '10442', 'link' : 'http://school.gaofen.com/college-10442.html', data : [
                    {name : '2010', sorce : [621, '639','18','14519']},
                    {name : '2011', sorce : [568, '589','21','14621']},
                    {name : '2012', sorce : [585, '585','0','']},
                    {name : '2013', sorce : [574, '602','28','15693']},
                    {name : '平均', sorce : ['', '603.75','16.75','14944.3333333333']}]},
                {'name' : '哈尔滨工业大学', 'code' : '10213', 'link' : 'http://school.gaofen.com/college-10213.html', data : [
                    {name : '2010', sorce : [621, '652','31','7458']},
                    {name : '2011', sorce : [568, '570','2','27812']},
                    {name : '2012', sorce : [585, '618','33','9387']},
                    {name : '2013', sorce : [574, '585','11','27213']},
                    {name : '平均', sorce : ['', '606.25','19.25','17967.5']}]},
                {'name' : '吉林大学', 'code' : '10183', 'link' : 'http://school.gaofen.com/college-10183.html', data : [
                    {name : '2010', sorce : [621, '632','11','19526']},
                    {name : '2011', sorce : [568, '581','13','19965']},
                    {name : '2012', sorce : [585, '594','9','22234']},
                    {name : '2013', sorce : [574, '598','24','17854']},
                    {name : '平均', sorce : ['', '601.25','14.25','19894.75']}]},
                {'name' : '广东外语外贸大学', 'code' : '11846', 'link' : 'http://school.gaofen.com/college-11846.html', data : [
                    {name : '2010', sorce : [621, '634','13','17940']},
                    {name : '2011', sorce : [568, '588','20','15494']},
                    {name : '2012', sorce : [585, '602','17','17488']},
                    {name : '2013', sorce : [574, '599','25','17668']},
                    {name : '平均', sorce : ['', '605.75','18.75','17147.5']}]},
                {'name' : '华南师范大学', 'code' : '10574', 'link' : 'http://school.gaofen.com/college-10574.html', data : [
                    {name : '2010', sorce : [621, '628','7','22895']},
                    {name : '2011', sorce : [568, '581','13','19956']},
                    {name : '2012', sorce : [585, '597','12','20245']},
                    {name : '2013', sorce : [574, '592','18','22242']},
                    {name : '平均', sorce : ['', '599.5','12.5','21334.5']}]},
                {'name' : '汕头大学', 'code' : '10560', 'link' : 'http://school.gaofen.com/college-10560.html', data : [
                    {name : '2010', sorce : [621, '621','0','29498']},
                    {name : '2011', sorce : [568, '568','0','31440']},
                    {name : '2012', sorce : [585, '585','0','']},
                    {name : '2013', sorce : [574, '580','6','31117']},
                    {name : '平均', sorce : ['', '588.5','6','30685']}]},
                {'name' : '南方医科大学', 'code' : '12121', 'link' : 'http://school.gaofen.com/college-12121.html', data : [
                    {name : '2010', sorce : [621, '621','0','29546']},
                    {name : '2011', sorce : [568, '568','0','39168']},
                    {name : '2012', sorce : [585, '585','0','']},
                    {name : '2013', sorce : [574, '585','11','26823']},
                    {name : '平均', sorce : ['', '589.75','2.75','31845.6666666667']}]},
                {'name' : '广州中医药大学', 'code' : '10572', 'link' : 'http://school.gaofen.com/college-10572.html', data : [
                    {name : '2010', sorce : [621, '621','0','29545']},
                    {name : '2011', sorce : [568, '568','0','45214']},
                    {name : '2012', sorce : [585, '585','0','']},
                    {name : '2013', sorce : [574, '574','0','']},
                    {name : '平均', sorce : ['', '587','0','37379.5']}]},
                {'name' : '华南农业大学', 'code' : '10564', 'link' : 'http://school.gaofen.com/college-10564.html', data : [
                    {name : '2010', sorce : [621, '621','0','40748']},
                    {name : '2011', sorce : [568, '568','0','38573']},
                    {name : '2012', sorce : [585, '585','0','']},
                    {name : '2013', sorce : [574, '574','0','']},
                    {name : '平均', sorce : ['', '587','0','39660.5']}]}
            ]}, {'name':'超一本线 20-39.9 分', key:'9', data : [
                {'name' : '东南大学', 'code' : '10286', 'link' : 'http://school.gaofen.com/college-10286.html', data : [
                    {name : '2010', sorce : [621, '648','27','9234']},
                    {name : '2011', sorce : [568, '596','28','11297']},
                    {name : '2012', sorce : [585, '619','34','9110']},
                    {name : '2013', sorce : [574, '619','45','8187']},
                    {name : '平均', sorce : ['', '620.5','33.5','9457']}]},
                {'name' : '天津大学', 'code' : '10056', 'link' : 'http://school.gaofen.com/college-10056.html', data : [
                    {name : '2010', sorce : [621, '654','33','6611']},
                    {name : '2011', sorce : [568, '593','25','12966']},
                    {name : '2012', sorce : [585, '615','30','10825']},
                    {name : '2013', sorce : [574, '618','44','8421']},
                    {name : '平均', sorce : ['', '620','33','9705.75']}]},
                {'name' : '华南理工大学', 'code' : '10561', 'link' : 'http://school.gaofen.com/college-10561.html', data : [
                    {name : '2010', sorce : [621, '645','24','10589']},
                    {name : '2011', sorce : [568, '600','32','9473']},
                    {name : '2012', sorce : [585, '619','34','9024']},
                    {name : '2013', sorce : [574, '617','43','9052']},
                    {name : '平均', sorce : ['', '620.25','33.25','9534.5']}]},
                {'name' : '中山大学', 'code' : '10558', 'link' : 'http://school.gaofen.com/college-10558.html', data : [
                    {name : '2010', sorce : [621, '644','23','11428']},
                    {name : '2011', sorce : [568, '609','41','6151']},
                    {name : '2012', sorce : [585, '628','43','6082']},
                    {name : '2013', sorce : [574, '625','51','6309']},
                    {name : '平均', sorce : ['', '626.5','39.5','7492.5']}]},
                {'name' : '华中科技大学', 'code' : '10487', 'link' : 'http://school.gaofen.com/college-10487.html', data : [
                    {name : '2010', sorce : [621, '654','33','6329']},
                    {name : '2011', sorce : [568, '606','38','7159']},
                    {name : '2012', sorce : [585, '605','20','15332']},
                    {name : '2013', sorce : [574, '616','42','9385']},
                    {name : '平均', sorce : ['', '620.25','33.25','9551.25']}]},
                {'name' : '武汉大学', 'code' : '10486', 'link' : 'http://school.gaofen.com/college-10486.html', data : [
                    {name : '2010', sorce : [621, '655','34','5971']},
                    {name : '2011', sorce : [568, '608','40','6495']},
                    {name : '2012', sorce : [585, '617','32','9602']},
                    {name : '2013', sorce : [574, '622','48','7178']},
                    {name : '平均', sorce : ['', '625.5','38.5','7311.5']}]},
                {'name' : '暨南大学', 'code' : '10559', 'link' : 'http://school.gaofen.com/college-10559.html', data : [
                    {name : '2010', sorce : [621, '642','21','12674']},
                    {name : '2011', sorce : [568, '596','28','11312']},
                    {name : '2012', sorce : [585, '613','28','11744']},
                    {name : '2013', sorce : [574, '610','36','11843']},
                    {name : '平均', sorce : ['', '615.25','28.25','11893.25']}]},
                {'name' : '四川大学', 'code' : '10610', 'link' : 'http://school.gaofen.com/college-10610.html', data : [
                    {name : '2010', sorce : [621, '639','18','14285']},
                    {name : '2011', sorce : [568, '588','20','15640']},
                    {name : '2012', sorce : [585, '611','26','12524']},
                    {name : '2013', sorce : [574, '602','28','15834']},
                    {name : '平均', sorce : ['', '610','23','14570.75']}]},
                {'name' : '中南大学', 'code' : '10533', 'link' : 'http://school.gaofen.com/college-10533.html', data : [
                    {name : '2010', sorce : [621, '638','17','15261']},
                    {name : '2011', sorce : [568, '591','23','13994']},
                    {name : '2012', sorce : [585, '611','26','12514']},
                    {name : '2013', sorce : [574, '606','32','13974']},
                    {name : '平均', sorce : ['', '611.5','24.5','13935.75']}]}
            ]}, {'name':'超一本线 40-59.9 分', key:'10', data : [

            ]}, {'name':'超一本线 60-79.9 分', key:'11', data : [
                {'name' : '中国人民大学', 'code' : '10002', 'link' : 'http://school.gaofen.com/college-10002.html', data : [
                    {name : '2010', sorce : [621, '682','61','519']},
                    {name : '2011', sorce : [568, '645','77','625']},
                    {name : '2012', sorce : [585, '661','76','772']},
                    {name : '2013', sorce : [574, '663','89','613']},
                    {name : '平均', sorce : ['', '662.75','75.75','632.25']}]},
                {'name' : '中国科学技术大学', 'code' : '10358', 'link' : 'http://school.gaofen.com/college-10358.html', data : [
                    {name : '2010', sorce : [621, '680','59','718']},
                    {name : '2011', sorce : [568, '643','75','700']},
                    {name : '2012', sorce : [585, '663','78','677']},
                    {name : '2013', sorce : [574, '661','87','727']},
                    {name : '平均', sorce : ['', '661.75','74.75','705.5']}]},
                {'name' : '浙江大学', 'code' : '10335', 'link' : 'http://school.gaofen.com/college-10335.html', data : [
                    {name : '2010', sorce : [621, '682','61','533']},
                    {name : '2011', sorce : [568, '648','80','501']},
                    {name : '2012', sorce : [585, '667','82','487']},
                    {name : '2013', sorce : [574, '665','91','527']},
                    {name : '平均', sorce : ['', '665.5','78.5','512']}]},
                {'name' : '南京大学', 'code' : '10284', 'link' : 'http://school.gaofen.com/college-10284.html', data : [
                    {name : '2010', sorce : [621, '678','57','839']},
                    {name : '2011', sorce : [568, '642','74','780']},
                    {name : '2012', sorce : [585, '660','75','803']},
                    {name : '2013', sorce : [574, '660','86','793']},
                    {name : '平均', sorce : ['', '660','73','803.75']}]},
                {'name' : '南开大学', 'code' : '10055', 'link' : 'http://school.gaofen.com/college-10055.html', data : [
                    {name : '2010', sorce : [621, '671','50','1753']},
                    {name : '2011', sorce : [568, '628','60','2032']},
                    {name : '2012', sorce : [585, '648','63','1893']},
                    {name : '2013', sorce : [574, '646','72','2041']},
                    {name : '平均', sorce : ['', '648.25','61.25','1929.75']}]}
            ]}, {'name':'超一本线 80-100 分', key:'12', data : [
                {'name' : '清华大学', 'code' : '10003', 'link' : 'http://school.gaofen.com/college-10003.html', data : [
                    {name : '2010', sorce : [621, '694','73','110']},
                    {name : '2011', sorce : [568, '666','98','95']},
                    {name : '2012', sorce : [585, '684','99','96']},
                    {name : '2013', sorce : [574, '681','107','111']},
                    {name : '平均', sorce : ['', '681.25','94.25','103']}]},
                {'name' : '北京大学', 'code' : '10001', 'link' : 'http://school.gaofen.com/college-10001.html', data : [
                    {name : '2010', sorce : [621, '697','73','118']},
                    {name : '2011', sorce : [568, '665','97','101']},
                    {name : '2012', sorce : [585, '683','98','100']},
                    {name : '2013', sorce : [574, '681','107','114']},
                    {name : '平均', sorce : ['', '681.5','93.75','108.25']}]},
                {'name' : '上海交通大学', 'code' : '10248', 'link' : 'http://school.gaofen.com/college-10248.html', data : [
                    {name : '2010', sorce : [621, '686','65','351']},
                    {name : '2011', sorce : [568, '654','86','284']},
                    {name : '2012', sorce : [585, '671','86','309']},
                    {name : '2013', sorce : [574, '672','98','274']},
                    {name : '平均', sorce : ['', '670.75','83.75','304.5']}]},
                {'name' : '复旦大学', 'code' : '10246', 'link' : 'http://school.gaofen.com/college-10246.html', data : [
                    {name : '2010', sorce : [621, '684','63','429']},
                    {name : '2011', sorce : [568, '655','87','260']},
                    {name : '2012', sorce : [585, '664','79','601']},
                    {name : '2013', sorce : [574, '674','100','236']},
                    {name : '平均', sorce : ['', '669.25','82.25','381.5']}]}
            ]}]},

        {'name' : '二A文科大学推荐', data :

            [
                {'name':'全部二A文科大学', key:'13', data :
                    [
                        {'name' : '深圳大学', 'code' : '10590', 'link' : 'http://school.gaofen.com/college-10590.html', data : [
                            {name : '2010', sorce : [554, '593','39','11714']},
                            {name : '2011', sorce : [536, '579','43','11218']},
                            {name : '2012', sorce : [545, '587','42','11054']},
                            {name : '2013', sorce : [546, '595','49','10490']},
                            {name : '平均', sorce : ['', '588.5','43.25','11119']}]},
                        {'name' : '广东财经大学（广东商学院）', 'code' : '10592', 'link' : 'http://school.gaofen.com/college-10592.html', data : [
                            {name : '2010', sorce : [554, '585','31','16175']},
                            {name : '2011', sorce : [536, '570','34','15828']},
                            {name : '2012', sorce : [545, '581','36','13614']},
                            {name : '2013', sorce : [546, '580','34','18793']},
                            {name : '平均', sorce : ['', '579','33.75','16102.5']}]},
                        {'name' : '广州大学', 'code' : '11078', 'link' : 'http://school.gaofen.com/college-11078.html', data : [
                            {name : '2010', sorce : [554, '583','29','16759']},
                            {name : '2011', sorce : [536, '568','32','16692']},
                            {name : '2012', sorce : [545, '577','32','15673']},
                            {name : '2013', sorce : [546, '583','37','16927']},
                            {name : '平均', sorce : ['', '577.75','32.5','16512.75']}]},
                        {'name' : '广东金融学院', 'code' : '11540', 'link' : 'http://school.gaofen.com/college-11540.html', data : [
                            {name : '2010', sorce : [554, '575','21','22586']},
                            {name : '2011', sorce : [536, '561','25','21137']},
                            {name : '2012', sorce : [545, '572','27','19213']},
                            {name : '2013', sorce : [546, '574','28','22551']},
                            {name : '平均', sorce : ['', '570.5','25.25','21371.75']}]},
                        {'name' : '广东工业大学', 'code' : '11845', 'link' : 'http://school.gaofen.com/college-11845.html', data : [
                            {name : '2010', sorce : [554, '575','21','22289']},
                            {name : '2011', sorce : [536, '560','24','22238']},
                            {name : '2012', sorce : [545, '570','25','20091']},
                            {name : '2013', sorce : [546, '576','30','21041']},
                            {name : '平均', sorce : ['', '570.25','25','21414.75']}]},
                        {'name' : '深圳大学', 'code' : '10590', 'link' : 'http://school.gaofen.com/college-10590.html', data : [
                            {name : '2010', sorce : [554, '570','16','26516']},
                            {name : '2011', sorce : [536, '559','23','22593']},
                            {name : '2012', sorce : [545, '567','22','22676']},
                            {name : '2013', sorce : [546, '572','26','24244']},
                            {name : '平均', sorce : ['', '567','21.75','24007.25']}]},
                        {'name' : '广州大学', 'code' : '11078', 'link' : 'http://school.gaofen.com/college-11078.html', data : [
                            {name : '2010', sorce : [554, '573','19','24268']},
                            {name : '2011', sorce : [536, '558','22','23095']},
                            {name : '2012', sorce : [545, '565','20','24101']},
                            {name : '2013', sorce : [546, '568','22','27331']},
                            {name : '平均', sorce : ['', '566','20.75','24698.75']}]},
                        {'name' : '广东技术师范学院', 'code' : '10588', 'link' : 'http://school.gaofen.com/college-10588.html', data : [
                            {name : '2010', sorce : [554, '570','16','25891']},
                            {name : '2011', sorce : [536, '557','21','24099']},
                            {name : '2012', sorce : [545, '561','16','26477']},
                            {name : '2013', sorce : [546, '570','24','25147']},
                            {name : '平均', sorce : ['', '564.5','19.25','25403.5']}]},
                        {'name' : '北京师范大学-香港浸会大学联合国际学院', 'code' : '16401', 'link' : 'http://school.gaofen.com/college-16401.html', data : [
                            {name : '2010', sorce : [554, '567','13','28724']},
                            {name : '2011', sorce : [536, '555','19','25322']},
                            {name : '2012', sorce : [545, '568','23','21520']},
                            {name : '2013', sorce : [546, '','','']},
                            {name : '平均', sorce : ['', '563.3333333333','18.3333333333','25188.6666666667']}]},
                        {'name' : '广州医学院', 'code' : '10570', 'link' : 'http://school.gaofen.com/college-10570.html', data : [
                            {name : '2010', sorce : [554, '567','13','28659']},
                            {name : '2011', sorce : [536, '552','16','27776']},
                            {name : '2012', sorce : [545, '563','18','25028']},
                            {name : '2013', sorce : [546, '571','25','24583']},
                            {name : '平均', sorce : ['', '563.25','18','26511.5']}]},
                        {'name' : '广州美术学院', 'code' : '10586', 'link' : 'http://school.gaofen.com/college-10586.html', data : [
                            {name : '2010', sorce : [554, '','','']},
                            {name : '2011', sorce : [536, '544','8','33735']},
                            {name : '2012', sorce : [545, '562','17','26034']},
                            {name : '2013', sorce : [546, '571','25','24896']},
                            {name : '平均', sorce : ['', '559','16.6666666667','28221.6666666667']}]},
                        {'name' : '仲恺农业工程学院', 'code' : '11347', 'link' : 'http://school.gaofen.com/college-11347.html', data : [
                            {name : '2010', sorce : [554, '567','13','28799']},
                            {name : '2011', sorce : [536, '553','17','27334']},
                            {name : '2012', sorce : [545, '560','15','27611']},
                            {name : '2013', sorce : [546, '564','18','29927']},
                            {name : '平均', sorce : ['', '561','15.75','28417.75']}]},
                        {'name' : '五邑大学', 'code' : '11349', 'link' : 'http://school.gaofen.com/college-11349.html', data : [
                            {name : '2010', sorce : [554, '566','12','29376']},
                            {name : '2011', sorce : [536, '549','13','41189']},
                            {name : '2012', sorce : [545, '559','14','28709']},
                            {name : '2013', sorce : [546, '564','18','30269']},
                            {name : '平均', sorce : ['', '559.5','14.25','32385.75']}]},
                        {'name' : '广东药学院', 'code' : '10573', 'link' : 'http://school.gaofen.com/college-10573.html', data : [
                            {name : '2010', sorce : [554, '562','8','32450']},
                            {name : '2011', sorce : [536, '550','14','29102']},
                            {name : '2012', sorce : [545, '560','15','27232']},
                            {name : '2013', sorce : [546, '562','16','31851']},
                            {name : '平均', sorce : ['', '558.5','13.25','30158.75']}]},
                        {'name' : '东莞理工学院', 'code' : '11819', 'link' : 'http://school.gaofen.com/college-11819.html', data : [
                            {name : '2010', sorce : [554, '567','13','28409']},
                            {name : '2011', sorce : [536, '548','12','30640']},
                            {name : '2012', sorce : [545, '555','10','31493']},
                            {name : '2013', sorce : [546, '561','15','32427']},
                            {name : '平均', sorce : ['', '557.75','12.5','30742.25']}]},
                        {'name' : '广州医学院', 'code' : '10570', 'link' : 'http://school.gaofen.com/college-10570.html', data : [
                            {name : '2010', sorce : [554, '559','5','34632']},
                            {name : '2011', sorce : [536, '548','12','30812']},
                            {name : '2012', sorce : [545, '558','13','29317']},
                            {name : '2013', sorce : [546, '561','15','32747']},
                            {name : '平均', sorce : ['', '556.5','11.25','31877']}]},
                        {'name' : '广东海洋大学', 'code' : '10566', 'link' : 'http://school.gaofen.com/college-10566.html', data : [
                            {name : '2010', sorce : [554, '560','6','34421']},
                            {name : '2011', sorce : [536, '545','9','33184']},
                            {name : '2012', sorce : [545, '553','8','33444']},
                            {name : '2013', sorce : [546, '556','10','37300']},
                            {name : '平均', sorce : ['', '553.5','8.25','34587.25']}]},
                        {'name' : '广东警官学院', 'code' : '11110', 'link' : 'http://school.gaofen.com/college-11110.html', data : [
                            {name : '2010', sorce : [554, '559','5','35234']},
                            {name : '2011', sorce : [536, '540','4','37451']},
                            {name : '2012', sorce : [545, '553','8','33696']},
                            {name : '2013', sorce : [546, '562','16','31711']},
                            {name : '平均', sorce : ['', '553.5','8.25','34523']}]},
                        {'name' : '佛山科学技术学院', 'code' : '11847', 'link' : 'http://school.gaofen.com/college-11847.html', data : [
                            {name : '2010', sorce : [554, '561','7','33425']},
                            {name : '2011', sorce : [536, '546','10','32003']},
                            {name : '2012', sorce : [545, '553','8','33478']},
                            {name : '2013', sorce : [546, '551','5','41543']},
                            {name : '平均', sorce : ['', '552.75','7.5','35112.25']}]},
                        {'name' : '惠州学院', 'code' : '10577', 'link' : 'http://school.gaofen.com/college-10577.html', data : [
                            {name : '2010', sorce : [554, '557','3','36286']},
                            {name : '2011', sorce : [536, '540','4','37094']},
                            {name : '2012', sorce : [545, '551','6','34697']},
                            {name : '2013', sorce : [546, '558','12','35190']},
                            {name : '平均', sorce : ['', '551.5','6.25','35816.75']}]},
                        {'name' : '广东第二师范学院（原广东教育学院）', 'code' : '14278', 'link' : 'http://school.gaofen.com/college-14278.html', data : [
                            {name : '2010', sorce : [554, '554','0','']},
                            {name : '2011', sorce : [536, '536','0','40645']},
                            {name : '2012', sorce : [545, '552','7','34606']},
                            {name : '2013', sorce : [546, '563','17','31013']},
                            {name : '平均', sorce : ['', '551.25','6','35421.3333333333']}]},
                        {'name' : '佛山科学技术学院', 'code' : '11847', 'link' : 'http://school.gaofen.com/college-11847.html', data : [
                            {name : '2010', sorce : [554, '555','1','38602']},
                            {name : '2011', sorce : [536, '543','7','35114']},
                            {name : '2012', sorce : [545, '551','6','35446']},
                            {name : '2013', sorce : [546, '551','5','41543']},
                            {name : '平均', sorce : ['', '550','4.75','37676.25']}]},
                        {'name' : '五邑大学', 'code' : '11349', 'link' : 'http://school.gaofen.com/college-11349.html', data : [
                            {name : '2010', sorce : [554, '560','6','34485']},
                            {name : '2011', sorce : [536, '536','0','29824']},
                            {name : '2012', sorce : [545, '547','2','38653']},
                            {name : '2013', sorce : [546, '553','7','39367']},
                            {name : '平均', sorce : ['', '549','3.75','35582.25']}]},
                        {'name' : '广东医学院', 'code' : '10571', 'link' : 'http://school.gaofen.com/college-10571.html', data : [
                            {name : '2010', sorce : [554, '555','1','38417']},
                            {name : '2011', sorce : [536, '540','4','37127']},
                            {name : '2012', sorce : [545, '550','5','35730']},
                            {name : '2013', sorce : [546, '549','3','42820']},
                            {name : '平均', sorce : ['', '548.5','3.25','38523.5']}]},
                        {'name' : '广州体育学院', 'code' : '10585', 'link' : 'http://school.gaofen.com/college-10585.html', data : [
                            {name : '2010', sorce : [554, '','','']},
                            {name : '2011', sorce : [536, '536','0','41479']},
                            {name : '2012', sorce : [545, '552','7','33921']},
                            {name : '2013', sorce : [546, '547','1','45283']},
                            {name : '平均', sorce : ['', '545','2.6666666667','40227.6666666667']}]},
                        {'name' : '肇庆学院', 'code' : '10580', 'link' : 'http://school.gaofen.com/college-10580.html', data : [
                            {name : '2010', sorce : [554, '554','0','']},
                            {name : '2011', sorce : [536, '537','1','40567']},
                            {name : '2012', sorce : [545, '547','2','39253']},
                            {name : '2013', sorce : [546, '553','7','39900']},
                            {name : '平均', sorce : ['', '547.75','2.5','39906.6666666667']}]},
                        {'name' : '湛江师范学院', 'code' : '10579', 'link' : 'http://school.gaofen.com/college-10579.html', data : [
                            {name : '2010', sorce : [554, '554','0','39649']},
                            {name : '2011', sorce : [536, '537','1','40387']},
                            {name : '2012', sorce : [545, '545','0','41156']},
                            {name : '2013', sorce : [546, '548','2','44263']},
                            {name : '平均', sorce : ['', '546','0.75','41363.75']}]},
                        {'name' : '韩山师范学院', 'code' : '10578', 'link' : 'http://school.gaofen.com/college-10578.html', data : [
                            {name : '2010', sorce : [554, '554','0','39853']},
                            {name : '2011', sorce : [536, '536','0','43478']},
                            {name : '2012', sorce : [545, '545','0','']},
                            {name : '2013', sorce : [546, '547','1','45287']},
                            {name : '平均', sorce : ['', '545.5','0.25','42872.6666666667']}]},
                        {'name' : '韶关学院', 'code' : '10576', 'link' : 'http://school.gaofen.com/college-10576.html', data : [
                            {name : '2010', sorce : [554, '554','0','38235']},
                            {name : '2011', sorce : [536, '536','0','41757']},
                            {name : '2012', sorce : [545, '545','0','']},
                            {name : '2013', sorce : [546, '547','1','45271']},
                            {name : '平均', sorce : ['', '545.5','0.25','41754.3333333333']}]},
                        {'name' : '嘉应学院', 'code' : '10582', 'link' : 'http://school.gaofen.com/college-10582.html', data : [
                            {name : '2010', sorce : [554, '554','0','40262']},
                            {name : '2011', sorce : [536, '536','0','43200']},
                            {name : '2012', sorce : [545, '545','0','']},
                            {name : '2013', sorce : [546, '546','0','46121']},
                            {name : '平均', sorce : ['', '545.25','0','43194.3333333333']}]},
                        {'name' : '广东石油化工学院', 'code' : '11656', 'link' : 'http://school.gaofen.com/college-11656.html', data : [
                            {name : '2010', sorce : [554, '554','0','40289']},
                            {name : '2011', sorce : [536, '536','0','42701']},
                            {name : '2012', sorce : [545, '545','0','']},
                            {name : '2013', sorce : [546, '546','0','']},
                            {name : '平均', sorce : ['', '545.25','0','41495']}]},
                        {'name' : '星海音乐学院', 'code' : '10587', 'link' : 'http://school.gaofen.com/college-10587.html', data : [
                            {name : '2010', sorce : [554, '','','']},
                            {name : '2011', sorce : [536, '536','0','']},
                            {name : '2012', sorce : [545, '545','0','']},
                            {name : '2013', sorce : [546, '546','0','']},
                            {name : '平均', sorce : ['', '542.3333333333','0','0']}]}
                    ]},
                {'name':'超二A线 0-19.9 分', key:'14', data : [
                    {'name' : '广东技术师范学院', 'code' : '10588', 'link' : 'http://school.gaofen.com/college-10588.html', data : [
                        {name : '2010', sorce : [554, '570','16','25891']},
                        {name : '2011', sorce : [536, '557','21','24099']},
                        {name : '2012', sorce : [545, '561','16','26477']},
                        {name : '2013', sorce : [546, '570','24','25147']},
                        {name : '平均', sorce : ['', '564.5','19.25','25403.5']}]},
                    {'name' : '北京师范大学-香港浸会大学联合国际学院', 'code' : '16401', 'link' : 'http://school.gaofen.com/college-16401.html', data : [
                        {name : '2010', sorce : [554, '567','13','28724']},
                        {name : '2011', sorce : [536, '555','19','25322']},
                        {name : '2012', sorce : [545, '568','23','21520']},
                        {name : '2013', sorce : [546, '','','']},
                        {name : '平均', sorce : ['', '563.3333333333','18.3333333333','25188.6666666667']}]},
                    {'name' : '广州医学院', 'code' : '10570', 'link' : 'http://school.gaofen.com/college-10570.html', data : [
                        {name : '2010', sorce : [554, '567','13','28659']},
                        {name : '2011', sorce : [536, '552','16','27776']},
                        {name : '2012', sorce : [545, '563','18','25028']},
                        {name : '2013', sorce : [546, '571','25','24583']},
                        {name : '平均', sorce : ['', '563.25','18','26511.5']}]},
                    {'name' : '广州美术学院', 'code' : '10586', 'link' : 'http://school.gaofen.com/college-10586.html', data : [
                        {name : '2010', sorce : [554, '','','']},
                        {name : '2011', sorce : [536, '544','8','33735']},
                        {name : '2012', sorce : [545, '562','17','26034']},
                        {name : '2013', sorce : [546, '571','25','24896']},
                        {name : '平均', sorce : ['', '559','16.6666666667','28221.6666666667']}]},
                    {'name' : '仲恺农业工程学院', 'code' : '11347', 'link' : 'http://school.gaofen.com/college-11347.html', data : [
                        {name : '2010', sorce : [554, '567','13','28799']},
                        {name : '2011', sorce : [536, '553','17','27334']},
                        {name : '2012', sorce : [545, '560','15','27611']},
                        {name : '2013', sorce : [546, '564','18','29927']},
                        {name : '平均', sorce : ['', '561','15.75','28417.75']}]},
                    {'name' : '五邑大学', 'code' : '11349', 'link' : 'http://school.gaofen.com/college-11349.html', data : [
                        {name : '2010', sorce : [554, '566','12','29376']},
                        {name : '2011', sorce : [536, '549','13','41189']},
                        {name : '2012', sorce : [545, '559','14','28709']},
                        {name : '2013', sorce : [546, '564','18','30269']},
                        {name : '平均', sorce : ['', '559.5','14.25','32385.75']}]},
                    {'name' : '广东药学院', 'code' : '10573', 'link' : 'http://school.gaofen.com/college-10573.html', data : [
                        {name : '2010', sorce : [554, '562','8','32450']},
                        {name : '2011', sorce : [536, '550','14','29102']},
                        {name : '2012', sorce : [545, '560','15','27232']},
                        {name : '2013', sorce : [546, '562','16','31851']},
                        {name : '平均', sorce : ['', '558.5','13.25','30158.75']}]},
                    {'name' : '东莞理工学院', 'code' : '11819', 'link' : 'http://school.gaofen.com/college-11819.html', data : [
                        {name : '2010', sorce : [554, '567','13','28409']},
                        {name : '2011', sorce : [536, '548','12','30640']},
                        {name : '2012', sorce : [545, '555','10','31493']},
                        {name : '2013', sorce : [546, '561','15','32427']},
                        {name : '平均', sorce : ['', '557.75','12.5','30742.25']}]},
                    {'name' : '广州医学院', 'code' : '10570', 'link' : 'http://school.gaofen.com/college-10570.html', data : [
                        {name : '2010', sorce : [554, '559','5','34632']},
                        {name : '2011', sorce : [536, '548','12','30812']},
                        {name : '2012', sorce : [545, '558','13','29317']},
                        {name : '2013', sorce : [546, '561','15','32747']},
                        {name : '平均', sorce : ['', '556.5','11.25','31877']}]},
                    {'name' : '广东海洋大学', 'code' : '10566', 'link' : 'http://school.gaofen.com/college-10566.html', data : [
                        {name : '2010', sorce : [554, '560','6','34421']},
                        {name : '2011', sorce : [536, '545','9','33184']},
                        {name : '2012', sorce : [545, '553','8','33444']},
                        {name : '2013', sorce : [546, '556','10','37300']},
                        {name : '平均', sorce : ['', '553.5','8.25','34587.25']}]},
                    {'name' : '广东警官学院', 'code' : '11110', 'link' : 'http://school.gaofen.com/college-11110.html', data : [
                        {name : '2010', sorce : [554, '559','5','35234']},
                        {name : '2011', sorce : [536, '540','4','37451']},
                        {name : '2012', sorce : [545, '553','8','33696']},
                        {name : '2013', sorce : [546, '562','16','31711']},
                        {name : '平均', sorce : ['', '553.5','8.25','34523']}]},
                    {'name' : '佛山科学技术学院', 'code' : '11847', 'link' : 'http://school.gaofen.com/college-11847.html', data : [
                        {name : '2010', sorce : [554, '561','7','33425']},
                        {name : '2011', sorce : [536, '546','10','32003']},
                        {name : '2012', sorce : [545, '553','8','33478']},
                        {name : '2013', sorce : [546, '551','5','41543']},
                        {name : '平均', sorce : ['', '552.75','7.5','35112.25']}]},
                    {'name' : '惠州学院', 'code' : '10577', 'link' : 'http://school.gaofen.com/college-10577.html', data : [
                        {name : '2010', sorce : [554, '557','3','36286']},
                        {name : '2011', sorce : [536, '540','4','37094']},
                        {name : '2012', sorce : [545, '551','6','34697']},
                        {name : '2013', sorce : [546, '558','12','35190']},
                        {name : '平均', sorce : ['', '551.5','6.25','35816.75']}]},
                    {'name' : '广东第二师范学院（原广东教育学院）', 'code' : '14278', 'link' : 'http://school.gaofen.com/college-14278.html', data : [
                        {name : '2010', sorce : [554, '554','0','']},
                        {name : '2011', sorce : [536, '536','0','40645']},
                        {name : '2012', sorce : [545, '552','7','34606']},
                        {name : '2013', sorce : [546, '563','17','31013']},
                        {name : '平均', sorce : ['', '551.25','6','35421.3333333333']}]},
                    {'name' : '佛山科学技术学院', 'code' : '11847', 'link' : 'http://school.gaofen.com/college-11847.html', data : [
                        {name : '2010', sorce : [554, '555','1','38602']},
                        {name : '2011', sorce : [536, '543','7','35114']},
                        {name : '2012', sorce : [545, '551','6','35446']},
                        {name : '2013', sorce : [546, '551','5','41543']},
                        {name : '平均', sorce : ['', '550','4.75','37676.25']}]},
                    {'name' : '五邑大学', 'code' : '11349', 'link' : 'http://school.gaofen.com/college-11349.html', data : [
                        {name : '2010', sorce : [554, '560','6','34485']},
                        {name : '2011', sorce : [536, '536','0','29824']},
                        {name : '2012', sorce : [545, '547','2','38653']},
                        {name : '2013', sorce : [546, '553','7','39367']},
                        {name : '平均', sorce : ['', '549','3.75','35582.25']}]},
                    {'name' : '广东医学院', 'code' : '10571', 'link' : 'http://school.gaofen.com/college-10571.html', data : [
                        {name : '2010', sorce : [554, '555','1','38417']},
                        {name : '2011', sorce : [536, '540','4','37127']},
                        {name : '2012', sorce : [545, '550','5','35730']},
                        {name : '2013', sorce : [546, '549','3','42820']},
                        {name : '平均', sorce : ['', '548.5','3.25','38523.5']}]},
                    {'name' : '广州体育学院', 'code' : '10585', 'link' : 'http://school.gaofen.com/college-10585.html', data : [
                        {name : '2010', sorce : [554, '','','']},
                        {name : '2011', sorce : [536, '536','0','41479']},
                        {name : '2012', sorce : [545, '552','7','33921']},
                        {name : '2013', sorce : [546, '547','1','45283']},
                        {name : '平均', sorce : ['', '545','2.6666666667','40227.6666666667']}]},
                    {'name' : '肇庆学院', 'code' : '10580', 'link' : 'http://school.gaofen.com/college-10580.html', data : [
                        {name : '2010', sorce : [554, '554','0','']},
                        {name : '2011', sorce : [536, '537','1','40567']},
                        {name : '2012', sorce : [545, '547','2','39253']},
                        {name : '2013', sorce : [546, '553','7','39900']},
                        {name : '平均', sorce : ['', '547.75','2.5','39906.6666666667']}]},
                    {'name' : '湛江师范学院', 'code' : '10579', 'link' : 'http://school.gaofen.com/college-10579.html', data : [
                        {name : '2010', sorce : [554, '554','0','39649']},
                        {name : '2011', sorce : [536, '537','1','40387']},
                        {name : '2012', sorce : [545, '545','0','41156']},
                        {name : '2013', sorce : [546, '548','2','44263']},
                        {name : '平均', sorce : ['', '546','0.75','41363.75']}]},
                    {'name' : '韩山师范学院', 'code' : '10578', 'link' : 'http://school.gaofen.com/college-10578.html', data : [
                        {name : '2010', sorce : [554, '554','0','39853']},
                        {name : '2011', sorce : [536, '536','0','43478']},
                        {name : '2012', sorce : [545, '545','0','']},
                        {name : '2013', sorce : [546, '547','1','45287']},
                        {name : '平均', sorce : ['', '545.5','0.25','42872.6666666667']}]},
                    {'name' : '韶关学院', 'code' : '10576', 'link' : 'http://school.gaofen.com/college-10576.html', data : [
                        {name : '2010', sorce : [554, '554','0','38235']},
                        {name : '2011', sorce : [536, '536','0','41757']},
                        {name : '2012', sorce : [545, '545','0','']},
                        {name : '2013', sorce : [546, '547','1','45271']},
                        {name : '平均', sorce : ['', '545.5','0.25','41754.3333333333']}]},
                    {'name' : '嘉应学院', 'code' : '10582', 'link' : 'http://school.gaofen.com/college-10582.html', data : [
                        {name : '2010', sorce : [554, '554','0','40262']},
                        {name : '2011', sorce : [536, '536','0','43200']},
                        {name : '2012', sorce : [545, '545','0','']},
                        {name : '2013', sorce : [546, '546','0','46121']},
                        {name : '平均', sorce : ['', '545.25','0','43194.3333333333']}]},
                    {'name' : '广东石油化工学院', 'code' : '11656', 'link' : 'http://school.gaofen.com/college-11656.html', data : [
                        {name : '2010', sorce : [554, '554','0','40289']},
                        {name : '2011', sorce : [536, '536','0','42701']},
                        {name : '2012', sorce : [545, '545','0','']},
                        {name : '2013', sorce : [546, '546','0','']},
                        {name : '平均', sorce : ['', '545.25','0','41495']}]},
                    {'name' : '星海音乐学院', 'code' : '10587', 'link' : 'http://school.gaofen.com/college-10587.html', data : [
                        {name : '2010', sorce : [554, '','','']},
                        {name : '2011', sorce : [536, '536','0','']},
                        {name : '2012', sorce : [545, '545','0','']},
                        {name : '2013', sorce : [546, '546','0','']},
                        {name : '平均', sorce : ['', '542.3333333333','0','0']}]}
                ]},
                {'name':'超二A线 20-39.9 分', key:'15', data : [
                    {'name' : '广东财经大学（广东商学院）', 'code' : '10592', 'link' : 'http://school.gaofen.com/college-10592.html', data : [
                        {name : '2010', sorce : [554, '585','31','16175']},
                        {name : '2011', sorce : [536, '570','34','15828']},
                        {name : '2012', sorce : [545, '581','36','13614']},
                        {name : '2013', sorce : [546, '580','34','18793']},
                        {name : '平均', sorce : ['', '579','33.75','16102.5']}]},
                    {'name' : '广州大学', 'code' : '11078', 'link' : 'http://school.gaofen.com/college-11078.html', data : [
                        {name : '2010', sorce : [554, '583','29','16759']},
                        {name : '2011', sorce : [536, '568','32','16692']},
                        {name : '2012', sorce : [545, '577','32','15673']},
                        {name : '2013', sorce : [546, '583','37','16927']},
                        {name : '平均', sorce : ['', '577.75','32.5','16512.75']}]},
                    {'name' : '广东金融学院', 'code' : '11540', 'link' : 'http://school.gaofen.com/college-11540.html', data : [
                        {name : '2010', sorce : [554, '575','21','22586']},
                        {name : '2011', sorce : [536, '561','25','21137']},
                        {name : '2012', sorce : [545, '572','27','19213']},
                        {name : '2013', sorce : [546, '574','28','22551']},
                        {name : '平均', sorce : ['', '570.5','25.25','21371.75']}]},
                    {'name' : '广东工业大学', 'code' : '11845', 'link' : 'http://school.gaofen.com/college-11845.html', data : [
                        {name : '2010', sorce : [554, '575','21','22289']},
                        {name : '2011', sorce : [536, '560','24','22238']},
                        {name : '2012', sorce : [545, '570','25','20091']},
                        {name : '2013', sorce : [546, '576','30','21041']},
                        {name : '平均', sorce : ['', '570.25','25','21414.75']}]},
                    {'name' : '深圳大学', 'code' : '10590', 'link' : 'http://school.gaofen.com/college-10590.html', data : [
                        {name : '2010', sorce : [554, '570','16','26516']},
                        {name : '2011', sorce : [536, '559','23','22593']},
                        {name : '2012', sorce : [545, '567','22','22676']},
                        {name : '2013', sorce : [546, '572','26','24244']},
                        {name : '平均', sorce : ['', '567','21.75','24007.25']}]},
                    {'name' : '广州大学', 'code' : '11078', 'link' : 'http://school.gaofen.com/college-11078.html', data : [
                        {name : '2010', sorce : [554, '573','19','24268']},
                        {name : '2011', sorce : [536, '558','22','23095']},
                        {name : '2012', sorce : [545, '565','20','24101']},
                        {name : '2013', sorce : [546, '568','22','27331']},
                        {name : '平均', sorce : ['', '566','20.75','24698.75']}]}
                ]},
                {'name':'超二A线 40-59.9 分', key:'16', data : [
                    {'name' : '深圳大学', 'code' : '10590', 'link' : 'http://school.gaofen.com/college-10590.html', data : [
                        {name : '2010', sorce : [554, '593','39','11714']},
                        {name : '2011', sorce : [536, '579','43','11218']},
                        {name : '2012', sorce : [545, '587','42','11054']},
                        {name : '2013', sorce : [546, '595','49','10490']},
                        {name : '平均', sorce : ['', '588.5','43.25','11119']}]}
                ]},
                {'name':'超二A线 60-79.9 分', key:'17', data : [

                ]},
                {'name':'超二A线 80-100 分', key:'18', data : [

                ]}]

        },

        {'name' : '二A理科大学推荐', data :

            [
                {'name':'全部二A理科大学', key:'19', data :
                    [
                        {'name' : '深圳大学', 'code' : '10590', 'link' : 'http://school.gaofen.com/college-10590.html', data : [
                            {name : '2010', sorce : [567, '620','53','30059']},
                            {name : '2011', sorce : [504, '570','66','28288']},
                            {name : '2012', sorce : [523, '585','62','29029']},
                            {name : '2013', sorce : [516, '577','61','34013']},
                            {name : '平均', sorce : ['', '588','60.5','30347.25']}]},
                        {'name' : '广东财经大学（广东商学院）', 'code' : '10592', 'link' : 'http://school.gaofen.com/college-10592.html', data : [
                            {name : '2010', sorce : [567, '606','39','45482']},
                            {name : '2011', sorce : [504, '551','47','45024']},
                            {name : '2012', sorce : [523, '573','50','39058']},
                            {name : '2013', sorce : [516, '560','44','50433']},
                            {name : '平均', sorce : ['', '572.5','45','44999.25']}]},
                        {'name' : '广州大学', 'code' : '11078', 'link' : 'http://school.gaofen.com/college-11078.html', data : [
                            {name : '2010', sorce : [567, '604','37','47627']},
                            {name : '2011', sorce : [504, '549','45','47125']},
                            {name : '2012', sorce : [523, '568','45','43566']},
                            {name : '2013', sorce : [516, '564','48','46362']},
                            {name : '平均', sorce : ['', '571.25','43.75','46170']}]},
                        {'name' : '广州医学院', 'code' : '10570', 'link' : 'http://school.gaofen.com/college-10570.html', data : [
                            {name : '2010', sorce : [567, '603','36','48291']},
                            {name : '2011', sorce : [504, '545','41','50667']},
                            {name : '2012', sorce : [523, '567','44','44939']},
                            {name : '2013', sorce : [516, '563','47','47099']},
                            {name : '平均', sorce : ['', '569.5','42','47749']}]},
                        {'name' : '广东工业大学', 'code' : '11845', 'link' : 'http://school.gaofen.com/college-11845.html', data : [
                            {name : '2010', sorce : [567, '603','36','48321']},
                            {name : '2011', sorce : [504, '547','43','48782']},
                            {name : '2012', sorce : [523, '565','42','47321']},
                            {name : '2013', sorce : [516, '558','42','51892']},
                            {name : '平均', sorce : ['', '568.25','40.75','49079']}]},
                        {'name' : '广东金融学院', 'code' : '11540', 'link' : 'http://school.gaofen.com/college-11540.html', data : [
                            {name : '2010', sorce : [567, '598','31','54896']},
                            {name : '2011', sorce : [504, '545','41','50996']},
                            {name : '2012', sorce : [523, '564','41','48462']},
                            {name : '2013', sorce : [516, '556','40','54673']},
                            {name : '平均', sorce : ['', '565.75','38.25','52256.75']}]},
                        {'name' : '东莞理工学院', 'code' : '11819', 'link' : 'http://school.gaofen.com/college-11819.html', data : [
                            {name : '2010', sorce : [567, '597','30','55578']},
                            {name : '2011', sorce : [504, '541','37','54452']},
                            {name : '2012', sorce : [523, '558','35','54198']},
                            {name : '2013', sorce : [516, '553','37','57860']},
                            {name : '平均', sorce : ['', '562.25','34.75','55522']}]},
                        {'name' : '广州大学', 'code' : '11078', 'link' : 'http://school.gaofen.com/college-11078.html', data : [
                            {name : '2010', sorce : [567, '592','25','62109']},
                            {name : '2011', sorce : [504, '535','31','60931']},
                            {name : '2012', sorce : [523, '551','28','61790']},
                            {name : '2013', sorce : [516, '547','31','64691']},
                            {name : '平均', sorce : ['', '556.25','28.75','62380.25']}]},
                        {'name' : '广东技术师范学院', 'code' : '10588', 'link' : 'http://school.gaofen.com/college-10588.html', data : [
                            {name : '2010', sorce : [567, '587','20','67626']},
                            {name : '2011', sorce : [504, '536','32','60062']},
                            {name : '2012', sorce : [523, '546','23','67313']},
                            {name : '2013', sorce : [516, '542','26','70377']},
                            {name : '平均', sorce : ['', '552.75','25.25','66344.5']}]},
                        {'name' : '深圳大学', 'code' : '10590', 'link' : 'http://school.gaofen.com/college-10590.html', data : [
                            {name : '2010', sorce : [567, '583','16','73710']},
                            {name : '2011', sorce : [504, '531','27','66034']},
                            {name : '2012', sorce : [523, '542','19','73238']},
                            {name : '2013', sorce : [516, '546','30','65861']},
                            {name : '平均', sorce : ['', '550.5','23','69710.75']}]},
                        {'name' : '仲恺农业工程学院', 'code' : '11347', 'link' : 'http://school.gaofen.com/college-11347.html', data : [
                            {name : '2010', sorce : [567, '583','16','72999']},
                            {name : '2011', sorce : [504, '528','24','68457']},
                            {name : '2012', sorce : [523, '547','24','67040']},
                            {name : '2013', sorce : [516, '539','23','73887']},
                            {name : '平均', sorce : ['', '549.25','21.75','70595.75']}]},
                        {'name' : '广州医学院', 'code' : '10570', 'link' : 'http://school.gaofen.com/college-10570.html', data : [
                            {name : '2010', sorce : [567, '579','12','78212']},
                            {name : '2011', sorce : [504, '521','17','76875']},
                            {name : '2012', sorce : [523, '544','21','70178']},
                            {name : '2013', sorce : [516, '538','22','75438']},
                            {name : '平均', sorce : ['', '545.5','18','75175.75']}]},
                        {'name' : '五邑大学', 'code' : '11349', 'link' : 'http://school.gaofen.com/college-11349.html', data : [
                            {name : '2010', sorce : [567, '582','15','74584']},
                            {name : '2011', sorce : [504, '521','17','77178']},
                            {name : '2012', sorce : [523, '540','17','74873']},
                            {name : '2013', sorce : [516, '535','19','78477']},
                            {name : '平均', sorce : ['', '544.5','17','76278']}]},
                        {'name' : '广东药学院', 'code' : '10573', 'link' : 'http://school.gaofen.com/college-10573.html', data : [
                            {name : '2010', sorce : [567, '576','9','81915']},
                            {name : '2011', sorce : [504, '521','17','76699']},
                            {name : '2012', sorce : [523, '541','18','73796']},
                            {name : '2013', sorce : [516, '535','19','78209']},
                            {name : '平均', sorce : ['', '543.25','15.75','77654.75']}]},
                        {'name' : '佛山科学技术学院', 'code' : '11847', 'link' : 'http://school.gaofen.com/college-11847.html', data : [
                            {name : '2010', sorce : [567, '578','11','']},
                            {name : '2011', sorce : [504, '525','21','71983']},
                            {name : '2012', sorce : [523, '536','13','80021']},
                            {name : '2013', sorce : [516, '528','12','87646']},
                            {name : '平均', sorce : ['', '541.75','14.25','79883.3333333333']}]},
                        {'name' : '星海音乐学院', 'code' : '10587', 'link' : 'http://school.gaofen.com/college-10587.html', data : [
                            {name : '2010', sorce : [567, '','','']},
                            {name : '2011', sorce : [504, '504','0','']},
                            {name : '2012', sorce : [523, '537','14','90682']},
                            {name : '2013', sorce : [516, '516','0','']},
                            {name : '平均', sorce : ['', '519','14','90682']}]},
                        {'name' : '广东海洋大学', 'code' : '10566', 'link' : 'http://school.gaofen.com/college-10566.html', data : [
                            {name : '2010', sorce : [567, '575','8','83197']},
                            {name : '2011', sorce : [504, '519','15','79078']},
                            {name : '2012', sorce : [523, '535','12','81231']},
                            {name : '2013', sorce : [516, '523','7','93299']},
                            {name : '平均', sorce : ['', '538','10.5','84201.25']}]},
                        {'name' : '广东警官学院', 'code' : '11110', 'link' : 'http://school.gaofen.com/college-11110.html', data : [
                            {name : '2010', sorce : [567, '572','5','']},
                            {name : '2011', sorce : [504, '511','7','87655']},
                            {name : '2012', sorce : [523, '532','9','84306']},
                            {name : '2013', sorce : [516, '535','19','78730']},
                            {name : '平均', sorce : ['', '537.5','10','83563.6666666667']}]},
                        {'name' : '广东医学院', 'code' : '10571', 'link' : 'http://school.gaofen.com/college-10571.html', data : [
                            {name : '2010', sorce : [567, '578','11','79813']},
                            {name : '2011', sorce : [504, '510','6','89362']},
                            {name : '2012', sorce : [523, '532','9','84707']},
                            {name : '2013', sorce : [516, '530','14','84340']},
                            {name : '平均', sorce : ['', '537.5','10','84555.5']}]},
                        {'name' : '惠州学院', 'code' : '10577', 'link' : 'http://school.gaofen.com/college-10577.html', data : [
                            {name : '2010', sorce : [567, '571','4','87812']},
                            {name : '2011', sorce : [504, '511','7','87253']},
                            {name : '2012', sorce : [523, '532','9','84698']},
                            {name : '2013', sorce : [516, '529','13','86889']},
                            {name : '平均', sorce : ['', '535.75','8.25','86663']}]},
                        {'name' : '佛山科学技术学院', 'code' : '11847', 'link' : 'http://school.gaofen.com/college-11847.html', data : [
                            {name : '2010', sorce : [567, '567','0','93977']},
                            {name : '2011', sorce : [504, '511','7','88265']},
                            {name : '2012', sorce : [523, '531','8','86714']},
                            {name : '2013', sorce : [516, '521','5','96160']},
                            {name : '平均', sorce : ['', '532.5','5','91279']}]},
                        {'name' : '肇庆学院', 'code' : '10580', 'link' : 'http://school.gaofen.com/college-10580.html', data : [
                            {name : '2010', sorce : [567, '567','0','']},
                            {name : '2011', sorce : [504, '508','4','91014']},
                            {name : '2012', sorce : [523, '530','7','87243']},
                            {name : '2013', sorce : [516, '524','8','92931']},
                            {name : '平均', sorce : ['', '532.25','4.75','67797']}]},
                        {'name' : '广东第二师范学院（原广东教育学院）', 'code' : '14278', 'link' : 'http://school.gaofen.com/college-14278.html', data : [
                            {name : '2010', sorce : [567, '567','0','55503']},
                            {name : '2011', sorce : [504, '504','','']},
                            {name : '2012', sorce : [523, '528','5','90451']},
                            {name : '2013', sorce : [516, '530','14','85548']},
                            {name : '平均', sorce : ['', '532.25','4.75','57875.5']}]},
                        {'name' : '五邑大学', 'code' : '11349', 'link' : 'http://school.gaofen.com/college-11349.html', data : [
                            {name : '2010', sorce : [567, '573','6','85743']},
                            {name : '2011', sorce : [504, '505','1','94269']},
                            {name : '2012', sorce : [523, '528','5','90305']},
                            {name : '2013', sorce : [516, '521','5','96355']},
                            {name : '平均', sorce : ['', '531.75','4.25','91668']}]},
                        {'name' : '东莞理工学院', 'code' : '11820', 'link' : 'http://school.gaofen.com/college-11820.html', data : [
                            {name : '2010', sorce : [567, '567','0','93394']},
                            {name : '2011', sorce : [504, '505','1','94310']},
                            {name : '2012', sorce : [523, '530','7','87825']},
                            {name : '2013', sorce : [516, '522','6','95549']},
                            {name : '平均', sorce : ['', '531','3.5','92769.5']}]},
                        {'name' : '韶关学院', 'code' : '10576', 'link' : 'http://school.gaofen.com/college-10576.html', data : [
                            {name : '2010', sorce : [567, '567','0','94952']},
                            {name : '2011', sorce : [504, '504','0','75079']},
                            {name : '2012', sorce : [523, '523','0','96840']},
                            {name : '2013', sorce : [516, '517','1','101516']},
                            {name : '平均', sorce : ['', '527.75','0.25','92096.75']}]},
                        {'name' : '广州体育学院', 'code' : '10585', 'link' : 'http://school.gaofen.com/college-10585.html', data : [
                            {name : '2010', sorce : [567, '','','']},
                            {name : '2011', sorce : [504, '504','0','']},
                            {name : '2012', sorce : [523, '523','0','95765']},
                            {name : '2013', sorce : [516, '516','0','']},
                            {name : '平均', sorce : ['', '514.3333333333','0','95765']}]},
                        {'name' : '嘉应学院', 'code' : '10582', 'link' : 'http://school.gaofen.com/college-10582.html', data : [
                            {name : '2010', sorce : [567, '567','0','96115']},
                            {name : '2011', sorce : [504, '504','0','97510']},
                            {name : '2012', sorce : [523, '523','0','']},
                            {name : '2013', sorce : [516, '516','0','']},
                            {name : '平均', sorce : ['', '527.5','0','96812.5']}]},
                        {'name' : '湛江师范学院', 'code' : '10579', 'link' : 'http://school.gaofen.com/college-10579.html', data : [
                            {name : '2010', sorce : [567, '567','0','83144']},
                            {name : '2011', sorce : [504, '504','0','85779']},
                            {name : '2012', sorce : [523, '523','0','']},
                            {name : '2013', sorce : [516, '516','0','']},
                            {name : '平均', sorce : ['', '527.5','0','42230.75']}]},
                        {'name' : '韩山师范学院', 'code' : '10578', 'link' : 'http://school.gaofen.com/college-10578.html', data : [
                            {name : '2010', sorce : [567, '567','0','84694']},
                            {name : '2011', sorce : [504, '504','0','96899']},
                            {name : '2012', sorce : [523, '523','0','']},
                            {name : '2013', sorce : [516, '516','0','']},
                            {name : '平均', sorce : ['', '527.5','0','90796.5']}]},
                        {'name' : '广东石油化工学院', 'code' : '11656', 'link' : 'http://school.gaofen.com/college-11656.html', data : [
                            {name : '2010', sorce : [567, '567','0','94828']},
                            {name : '2011', sorce : [504, '504','0','92936']},
                            {name : '2012', sorce : [523, '523','0','96845']},
                            {name : '2013', sorce : [516, '516','0','103543']},
                            {name : '平均', sorce : ['', '527.5','0','97038']}]}
                    ]},
                {'name':'超二A线 0-19.9 分', key:'20', data : [
                    {'name' : '广州医学院', 'code' : '10570', 'link' : 'http://school.gaofen.com/college-10570.html', data : [
                        {name : '2010', sorce : [567, '579','12','78212']},
                        {name : '2011', sorce : [504, '521','17','76875']},
                        {name : '2012', sorce : [523, '544','21','70178']},
                        {name : '2013', sorce : [516, '538','22','75438']},
                        {name : '平均', sorce : ['', '545.5','18','75175.75']}]},
                    {'name' : '五邑大学', 'code' : '11349', 'link' : 'http://school.gaofen.com/college-11349.html', data : [
                        {name : '2010', sorce : [567, '582','15','74584']},
                        {name : '2011', sorce : [504, '521','17','77178']},
                        {name : '2012', sorce : [523, '540','17','74873']},
                        {name : '2013', sorce : [516, '535','19','78477']},
                        {name : '平均', sorce : ['', '544.5','17','76278']}]},
                    {'name' : '广东药学院', 'code' : '10573', 'link' : 'http://school.gaofen.com/college-10573.html', data : [
                        {name : '2010', sorce : [567, '576','9','81915']},
                        {name : '2011', sorce : [504, '521','17','76699']},
                        {name : '2012', sorce : [523, '541','18','73796']},
                        {name : '2013', sorce : [516, '535','19','78209']},
                        {name : '平均', sorce : ['', '543.25','15.75','77654.75']}]},
                    {'name' : '佛山科学技术学院', 'code' : '11847', 'link' : 'http://school.gaofen.com/college-11847.html', data : [
                        {name : '2010', sorce : [567, '578','11','']},
                        {name : '2011', sorce : [504, '525','21','71983']},
                        {name : '2012', sorce : [523, '536','13','80021']},
                        {name : '2013', sorce : [516, '528','12','87646']},
                        {name : '平均', sorce : ['', '541.75','14.25','79883.3333333333']}]},
                    {'name' : '星海音乐学院', 'code' : '10587', 'link' : 'http://school.gaofen.com/college-10587.html', data : [
                        {name : '2010', sorce : [567, '','','']},
                        {name : '2011', sorce : [504, '504','0','']},
                        {name : '2012', sorce : [523, '537','14','90682']},
                        {name : '2013', sorce : [516, '516','0','']},
                        {name : '平均', sorce : ['', '519','14','90682']}]},
                    {'name' : '广东海洋大学', 'code' : '10566', 'link' : 'http://school.gaofen.com/college-10566.html', data : [
                        {name : '2010', sorce : [567, '575','8','83197']},
                        {name : '2011', sorce : [504, '519','15','79078']},
                        {name : '2012', sorce : [523, '535','12','81231']},
                        {name : '2013', sorce : [516, '523','7','93299']},
                        {name : '平均', sorce : ['', '538','10.5','84201.25']}]},
                    {'name' : '广东警官学院', 'code' : '11110', 'link' : 'http://school.gaofen.com/college-11110.html', data : [
                        {name : '2010', sorce : [567, '572','5','']},
                        {name : '2011', sorce : [504, '511','7','87655']},
                        {name : '2012', sorce : [523, '532','9','84306']},
                        {name : '2013', sorce : [516, '535','19','78730']},
                        {name : '平均', sorce : ['', '537.5','10','83563.6666666667']}]},
                    {'name' : '广东医学院', 'code' : '10571', 'link' : 'http://school.gaofen.com/college-10571.html', data : [
                        {name : '2010', sorce : [567, '578','11','79813']},
                        {name : '2011', sorce : [504, '510','6','89362']},
                        {name : '2012', sorce : [523, '532','9','84707']},
                        {name : '2013', sorce : [516, '530','14','84340']},
                        {name : '平均', sorce : ['', '537.5','10','84555.5']}]},
                    {'name' : '惠州学院', 'code' : '10577', 'link' : 'http://school.gaofen.com/college-10577.html', data : [
                        {name : '2010', sorce : [567, '571','4','87812']},
                        {name : '2011', sorce : [504, '511','7','87253']},
                        {name : '2012', sorce : [523, '532','9','84698']},
                        {name : '2013', sorce : [516, '529','13','86889']},
                        {name : '平均', sorce : ['', '535.75','8.25','86663']}]},
                    {'name' : '佛山科学技术学院', 'code' : '11847', 'link' : 'http://school.gaofen.com/college-11847.html', data : [
                        {name : '2010', sorce : [567, '567','0','93977']},
                        {name : '2011', sorce : [504, '511','7','88265']},
                        {name : '2012', sorce : [523, '531','8','86714']},
                        {name : '2013', sorce : [516, '521','5','96160']},
                        {name : '平均', sorce : ['', '532.5','5','91279']}]},
                    {'name' : '肇庆学院', 'code' : '10580', 'link' : 'http://school.gaofen.com/college-10580.html', data : [
                        {name : '2010', sorce : [567, '567','0','']},
                        {name : '2011', sorce : [504, '508','4','91014']},
                        {name : '2012', sorce : [523, '530','7','87243']},
                        {name : '2013', sorce : [516, '524','8','92931']},
                        {name : '平均', sorce : ['', '532.25','4.75','67797']}]},
                    {'name' : '广东第二师范学院（原广东教育学院）', 'code' : '14278', 'link' : 'http://school.gaofen.com/college-14278.html', data : [
                        {name : '2010', sorce : [567, '567','0','55503']},
                        {name : '2011', sorce : [504, '504','','']},
                        {name : '2012', sorce : [523, '528','5','90451']},
                        {name : '2013', sorce : [516, '530','14','85548']},
                        {name : '平均', sorce : ['', '532.25','4.75','57875.5']}]},
                    {'name' : '五邑大学', 'code' : '11349', 'link' : 'http://school.gaofen.com/college-11349.html', data : [
                        {name : '2010', sorce : [567, '573','6','85743']},
                        {name : '2011', sorce : [504, '505','1','94269']},
                        {name : '2012', sorce : [523, '528','5','90305']},
                        {name : '2013', sorce : [516, '521','5','96355']},
                        {name : '平均', sorce : ['', '531.75','4.25','91668']}]},
                    {'name' : '东莞理工学院', 'code' : '11820', 'link' : 'http://school.gaofen.com/college-11820.html', data : [
                        {name : '2010', sorce : [567, '567','0','93394']},
                        {name : '2011', sorce : [504, '505','1','94310']},
                        {name : '2012', sorce : [523, '530','7','87825']},
                        {name : '2013', sorce : [516, '522','6','95549']},
                        {name : '平均', sorce : ['', '531','3.5','92769.5']}]},
                    {'name' : '韶关学院', 'code' : '10576', 'link' : 'http://school.gaofen.com/college-10576.html', data : [
                        {name : '2010', sorce : [567, '567','0','94952']},
                        {name : '2011', sorce : [504, '504','0','75079']},
                        {name : '2012', sorce : [523, '523','0','96840']},
                        {name : '2013', sorce : [516, '517','1','101516']},
                        {name : '平均', sorce : ['', '527.75','0.25','92096.75']}]},
                    {'name' : '广州体育学院', 'code' : '10585', 'link' : 'http://school.gaofen.com/college-10585.html', data : [
                        {name : '2010', sorce : [567, '','','']},
                        {name : '2011', sorce : [504, '504','0','']},
                        {name : '2012', sorce : [523, '523','0','95765']},
                        {name : '2013', sorce : [516, '516','0','']},
                        {name : '平均', sorce : ['', '514.3333333333','0','95765']}]},
                    {'name' : '嘉应学院', 'code' : '10582', 'link' : 'http://school.gaofen.com/college-10582.html', data : [
                        {name : '2010', sorce : [567, '567','0','96115']},
                        {name : '2011', sorce : [504, '504','0','97510']},
                        {name : '2012', sorce : [523, '523','0','']},
                        {name : '2013', sorce : [516, '516','0','']},
                        {name : '平均', sorce : ['', '527.5','0','96812.5']}]},
                    {'name' : '湛江师范学院', 'code' : '10579', 'link' : 'http://school.gaofen.com/college-10579.html', data : [
                        {name : '2010', sorce : [567, '567','0','83144']},
                        {name : '2011', sorce : [504, '504','0','85779']},
                        {name : '2012', sorce : [523, '523','0','']},
                        {name : '2013', sorce : [516, '516','0','']},
                        {name : '平均', sorce : ['', '527.5','0','42230.75']}]},
                    {'name' : '韩山师范学院', 'code' : '10578', 'link' : 'http://school.gaofen.com/college-10578.html', data : [
                        {name : '2010', sorce : [567, '567','0','84694']},
                        {name : '2011', sorce : [504, '504','0','96899']},
                        {name : '2012', sorce : [523, '523','0','']},
                        {name : '2013', sorce : [516, '516','0','']},
                        {name : '平均', sorce : ['', '527.5','0','90796.5']}]},
                    {'name' : '广东石油化工学院', 'code' : '11656', 'link' : 'http://school.gaofen.com/college-11656.html', data : [
                        {name : '2010', sorce : [567, '567','0','94828']},
                        {name : '2011', sorce : [504, '504','0','92936']},
                        {name : '2012', sorce : [523, '523','0','96845']},
                        {name : '2013', sorce : [516, '516','0','103543']},
                        {name : '平均', sorce : ['', '527.5','0','97038']}]}
                ]},
                {'name':'超二A线 20-39.9 分', key:'21', data : [
                    {'name' : '广东金融学院', 'code' : '11540', 'link' : 'http://school.gaofen.com/college-11540.html', data : [
                        {name : '2010', sorce : [567, '598','31','54896']},
                        {name : '2011', sorce : [504, '545','41','50996']},
                        {name : '2012', sorce : [523, '564','41','48462']},
                        {name : '2013', sorce : [516, '556','40','54673']},
                        {name : '平均', sorce : ['', '565.75','38.25','52256.75']}]},
                    {'name' : '东莞理工学院', 'code' : '11819', 'link' : 'http://school.gaofen.com/college-11819.html', data : [
                        {name : '2010', sorce : [567, '597','30','55578']},
                        {name : '2011', sorce : [504, '541','37','54452']},
                        {name : '2012', sorce : [523, '558','35','54198']},
                        {name : '2013', sorce : [516, '553','37','57860']},
                        {name : '平均', sorce : ['', '562.25','34.75','55522']}]},
                    {'name' : '广州大学', 'code' : '11078', 'link' : 'http://school.gaofen.com/college-11078.html', data : [
                        {name : '2010', sorce : [567, '592','25','62109']},
                        {name : '2011', sorce : [504, '535','31','60931']},
                        {name : '2012', sorce : [523, '551','28','61790']},
                        {name : '2013', sorce : [516, '547','31','64691']},
                        {name : '平均', sorce : ['', '556.25','28.75','62380.25']}]},
                    {'name' : '广东技术师范学院', 'code' : '10588', 'link' : 'http://school.gaofen.com/college-10588.html', data : [
                        {name : '2010', sorce : [567, '587','20','67626']},
                        {name : '2011', sorce : [504, '536','32','60062']},
                        {name : '2012', sorce : [523, '546','23','67313']},
                        {name : '2013', sorce : [516, '542','26','70377']},
                        {name : '平均', sorce : ['', '552.75','25.25','66344.5']}]},
                    {'name' : '深圳大学', 'code' : '10590', 'link' : 'http://school.gaofen.com/college-10590.html', data : [
                        {name : '2010', sorce : [567, '583','16','73710']},
                        {name : '2011', sorce : [504, '531','27','66034']},
                        {name : '2012', sorce : [523, '542','19','73238']},
                        {name : '2013', sorce : [516, '546','30','65861']},
                        {name : '平均', sorce : ['', '550.5','23','69710.75']}]},
                    {'name' : '仲恺农业工程学院', 'code' : '11347', 'link' : 'http://school.gaofen.com/college-11347.html', data : [
                        {name : '2010', sorce : [567, '583','16','72999']},
                        {name : '2011', sorce : [504, '528','24','68457']},
                        {name : '2012', sorce : [523, '547','24','67040']},
                        {name : '2013', sorce : [516, '539','23','73887']},
                        {name : '平均', sorce : ['', '549.25','21.75','70595.75']}]}
                ]},
                {'name':'超二A线 40-59.9 分', key:'22', data : [
                    {'name' : '广东财经大学（广东商学院）', 'code' : '10592', 'link' : 'http://school.gaofen.com/college-10592.html', data : [
                        {name : '2010', sorce : [567, '606','39','45482']},
                        {name : '2011', sorce : [504, '551','47','45024']},
                        {name : '2012', sorce : [523, '573','50','39058']},
                        {name : '2013', sorce : [516, '560','44','50433']},
                        {name : '平均', sorce : ['', '572.5','45','44999.25']}]},
                    {'name' : '广州大学', 'code' : '11078', 'link' : 'http://school.gaofen.com/college-11078.html', data : [
                        {name : '2010', sorce : [567, '604','37','47627']},
                        {name : '2011', sorce : [504, '549','45','47125']},
                        {name : '2012', sorce : [523, '568','45','43566']},
                        {name : '2013', sorce : [516, '564','48','46362']},
                        {name : '平均', sorce : ['', '571.25','43.75','46170']}]},
                    {'name' : '广州医学院', 'code' : '10570', 'link' : 'http://school.gaofen.com/college-10570.html', data : [
                        {name : '2010', sorce : [567, '603','36','48291']},
                        {name : '2011', sorce : [504, '545','41','50667']},
                        {name : '2012', sorce : [523, '567','44','44939']},
                        {name : '2013', sorce : [516, '563','47','47099']},
                        {name : '平均', sorce : ['', '569.5','42','47749']}]},
                    {'name' : '广东工业大学', 'code' : '11845', 'link' : 'http://school.gaofen.com/college-11845.html', data : [
                        {name : '2010', sorce : [567, '603','36','48321']},
                        {name : '2011', sorce : [504, '547','43','48782']},
                        {name : '2012', sorce : [523, '565','42','47321']},
                        {name : '2013', sorce : [516, '558','42','51892']},
                        {name : '平均', sorce : ['', '568.25','40.75','49079']}]}
                ]},
                {'name':'超二A线 60-79.9 分', key:'23', data : [
                    {'name' : '深圳大学', 'code' : '10590', 'link' : 'http://school.gaofen.com/college-10590.html', data : [
                        {name : '2010', sorce : [567, '620','53','30059']},
                        {name : '2011', sorce : [504, '570','66','28288']},
                        {name : '2012', sorce : [523, '585','62','29029']},
                        {name : '2013', sorce : [516, '577','61','34013']},
                        {name : '平均', sorce : ['', '588','60.5','30347.25']}]}
                ]},
                {'name':'超二A线 80-100 分', key:'24', data : [

                ]}]

        },


        {'name' : '热门二B文理科大学推荐', data : [
            {name : '二B大学',code:'10000', link:'http://g.cn', data : [
                {'name' : '广东外语外贸大学南国商学院', 'code' : '12620', 'link' : 'http://school.gaofen.com/college-12620.html', data : [
                    {name : '2010', sorce : [518, '537','19','55117']},
                    {name : '2011', sorce : [489, '522','33','54670']},
                    {name : '2012', sorce : [502, '534','32','52255']},
                    {name : '2013', sorce : [498, '532','34','59403']},
                    {name : '平均', sorce : ['', '531.25','29.5','55361 ']}]},
                {'name' : '电子科技大学中山学院', 'code' : '11545', 'link' : 'http://school.gaofen.com/college-11545.html', data : [
                    {name : '2010', sorce : [518, '525','7','66792']},
                    {name : '2011', sorce : [489, '500','11','68419']},
                    {name : '2012', sorce : [502, '519','17','68470']},
                    {name : '2013', sorce : [498, '516','18','75835']},
                    {name : '平均', sorce : ['', '515','13.25','69879 ']}]},
                {'name' : '中山大学南方学院', 'code' : '12619', 'link' : 'http://school.gaofen.com/college-12619.html', data : [
                    {name : '2010', sorce : [518, '527','9','64731']},
                    {name : '2011', sorce : [489, '513','24','64004']},
                    {name : '2012', sorce : [502, '524','22','63034']},
                    {name : '2013', sorce : [498, '522','24','70445']},
                    {name : '平均', sorce : ['', '521.5','19.75','65554 ']}]},
                {'name' : '北京师范大学珠海分校', 'code' : '13177', 'link' : 'http://school.gaofen.com/college-13177.html', data : [
                    {name : '2010', sorce : [518, '548','30','44981']},
                    {name : '2011', sorce : [489, '534','45','46345']},
                    {name : '2012', sorce : [502, '541','39','44663']},
                    {name : '2013', sorce : [498, '543','45','48536']},
                    {name : '平均', sorce : ['', '541.5','39.75','46131 ']}]},
                {'name' : '吉林大学珠海学院', 'code' : '13684', 'link' : 'http://school.gaofen.com/college-13684.html', data : [
                    {name : '2010', sorce : [518, '534','16','57609']},
                    {name : '2011', sorce : [489, '518','29','58376']},
                    {name : '2012', sorce : [502, '531','29','54622']},
                    {name : '2013', sorce : [498, '535','37','57105']},
                    {name : '平均', sorce : ['', '529.5','27.75','56928 ']}]}
            ]},
            {name : '南华大学',code:'10001', link:'http://g.cn', data : [
                { name : '2010', sorce:[668,668,688,688]},
                { name : '2011', sorce:[1,2,688,688]},
                { name : '2011', sorce:[668,668,688,688]},
                { name : '2011', sorce:[3,668,688,688]},
                { name : '平均', sorce:[5,668,688,688]}
            ]}

        ]},

        {'name' : '热门三A文理科大学推荐', data : [
            {'name' : '广州中医药大学', 'code' : '10572', 'link' : 'http://school.gaofen.com/college-10572.html', data : [
                {name : '2010', sorce : [469, '533','64']},
                {name : '2011', sorce : [439, '516','77']},
                {name : '2012', sorce : [445, '525','80']},
                {name : '2013', sorce : [430, '517','87']},
                {name : '平均', sorce : ['', '522.75','77']}]},
            {'name' : '广东轻工职业技术学院', 'code' : '10833', 'link' : 'http://school.gaofen.com/college-10833.html', data : [
                {name : '2010', sorce : [469, '540','71']},
                {name : '2011', sorce : [439, '520','81']},
                {name : '2012', sorce : [445, '515','70']},
                {name : '2013', sorce : [430, '527','97']},
                {name : '平均', sorce : ['', '525.5','79.75']}]},
            {'name' : '佛山科学技术学院', 'code' : '11847', 'link' : 'http://school.gaofen.com/college-11847.html', data : [
                {name : '2010', sorce : [469, '515','46']},
                {name : '2011', sorce : [439, '471','32']},
                {name : '2012', sorce : [445, '506','61']},
                {name : '2013', sorce : [430, '430','0']},
                {name : '平均', sorce : ['', '480.5','34.75']}]},
            {'name' : '南方医科大学', 'code' : '12121', 'link' : 'http://school.gaofen.com/college-12121.html', data : [
                {name : '2010', sorce : [469, '541','72']},
                {name : '2011', sorce : [439, '524','85']},
                {name : '2012', sorce : [445, '529','84']},
                {name : '2013', sorce : [430, '531','101']},
                {name : '平均', sorce : ['', '531.25','85.5']}]},
            {'name' : '广东外语艺术职业学院', 'code' : '12962', 'link' : 'http://school.gaofen.com/college-12962.html', data : [
                {name : '2010', sorce : [469, '493','24']},
                {name : '2011', sorce : [439, '462','23']},
                {name : '2012', sorce : [445, '482','37']},
                {name : '2013', sorce : [430, '472','42']},
                {name : '平均', sorce : ['', '477.25','31.5']}]}
        ]}


    ];


    var keys = [1,2,3,4,5,6,7,8,9,10,11,12,13];

    exports.getSchool = {

        getApp : function(req, res){
            if(keys.length === 0){
                res.send('<div>成功---success</div>');
                return;
            }
           var key =  keys.shift();
           // var url = 'http://cp.gaofen.com/cache/schoolfenshu/schoolfenshu1.txt';
            nodegrass.get("http://www.test.com/testforqq.php?key="+key,function(data,status,headers){
                //console.log(status);
                //console.log(headers);

                if(typeof data === 'string'){
                    var v = eval("("+data+")");
                    v = JSON.parse(v);
                    //console.log(v.name);
                    //var v = JSON.parse('{\"name\":\"1\"}');
                    //console.log(v.name)
                    for(var k in v){
                        console.log(v[k]);
                    }
                }else{

                    console.log('not string');

                }
            },'gbk').on('error', function(e) {
                    console.log("Got error: " + e.message);
            });
        },


        getKeyMap : function(key){
            function get(){
                var result = '';
                for(var k=0;i<bigClass.length;i++){
                    var item = bigClass[i].data;
                    if(item){
                        var len = item.length;
                        for(var j=0;j<len;j<len){
                            var _item = item[j];
                            if(!_item.key ) continue;
                            if( key === _item.key){
                                result =  _item;

                            }

                        }

                    }

                }
                return result;
            }



        },


        pushData : function(org, data){
            for(var i=0;i<data.length;i++)
                org.push(data[i])

        }




    }


})();

